       01 WRK-CABEC.                                                    00010006
          05 WRK-CABEC1.                                                00020006
            10 FILLER   PIC X(12).                                      00030006
            10 FILLER   PIC X(37) VALUE                                 00040006
               'RELATORIO DE FUNCIONARIOS       PAG: '.                 00050006
            10 WRK-PAG  PIC 9(02) VALUE 1.                              00060008
            10 FILLER   PIC X(07).                                      00070006
          05 WRK-CABEC2.                                                00080006
            10 FILLER   PIC X(06) VALUE 'PAG   '.                       00090006
            10 FILLER   PIC X(09) VALUE 'ID       '.                    00100006
            10 FILLER   PIC X(04) VALUE 'NOME'.                         00110006
            10 FILLER   PIC X(26).                                      00120006
            10 FILLER   PIC X(12) VALUE 'SETOR       '.                 00130006
            10 FILLER   PIC X(07) VALUE 'SALARIO'.                      00140006
