       01 WRK-FUNC.                                                     00010000
          05 WRK-IDFUNC    PIC X(05).                                   00020000
          05 FILLER        PIC X(04) VALUE SPACES.                      00030000
          05 WRK-NOMEFUNC  PIC X(30).                                   00040000
          05 WRK-SETORFUNC PIC 9(04).                                   00050000
          05 FILLER        PIC X(08) VALUE SPACES.                      00060000
          05 WRK-SALFUNC   PIC $9.999,99.                               00070000
          05 FILLER        PIC X(01) VALUE SPACES.                      00080001
