       01 ARQ-MOV1207.
          05 ARQ-MOV1207-CHAVE.
             10 ARQ-MOV1207-AGENCIA            PIC X(04).
             10 ARQ-MOV1207-CONTA              PIC X(05).
          05 ARQ-MOV1207-SALARIO               PIC X(10).
