       01 REG-EVSA0407.
          05 ARQ-CHAVE .
             10 ARQ-AGENCIA     PIC X(04).
             10 ARQ-CONTA       PIC X(05).
          05 ARQ-SALARIO        PIC X(10).
