      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. ARQ2101.                                             00040000
      *=============================================================*   00051000
      *   AUTOR....:VICTOR ARANDA                                   *   00052000
      *   ANALISTA.:IVAN PETRUCCI                  - INSTRUTOR      *   00053000
      *   DATA ....:22/04/2022                                      *   00054001
      *-------------------------------------------------------------*   00055000
      *   OBJETIVO:VALIDAR TRANSACOES DO ARQUIVO CLIENTES           *   00056001
      *                                                             *   00057000
      *                                                             *   00058000
      *-------------------------------------------------------------*   00059600
      *   ARQUIVOS:                                                 *   00059700
      *    DDNAME              I/O                  COPY/BOOK       *   00059800
      *    CLIENTES             I                                   *   00059902
      *    SAIDACLI             O                                   *   00060001
      *=============================================================*   00070000
       ENVIRONMENT                               DIVISION.              00102000
      *====================================================             00103000
       CONFIGURATION                             SECTION .              00104000
                                                                        00104100
       SPECIAL-NAMES.                                                   00104200
           DECIMAL-POINT IS COMMA.                                      00104300
                                                                        00104400
       INPUT-OUTPUT                              SECTION.               00104500
                                                                        00104600
       FILE-CONTROL.                                                    00104700
           SELECT CLIENTES ASSIGN TO CLIENTES                           00104800
               FILE STATUS     IS    WRK-STATUS.                        00104900
                                                                        00105000
           SELECT SAIDACLI ASSIGN TO SAIDACLI                           00105400
               FILE STATUS     IS    WRK-STATUS-SAI.                    00105500
                                                                        00105600
      *====================================================             00105700
       DATA                                      DIVISION.              00106000
      *====================================================             00107000
       FILE                                       SECTION.              00107100
      *====================================================             00107200
                                                                        00107300
      *===================CLIENTES=========================             00107400
                                                                        00107500
       FD CLIENTES                                                      00108200
           RECORDING  MODE IS F                                         00108300
           BLOCK CONTAINS 0 RECORDS.                                    00108400
                                                                        00108500
        01 FD-CLIENTES.                                                 00108700
           05 FD-AGENCIA     PIC 9(04).                                 00108800
           05 FD-CONTA       PIC 9(05).                                 00108900
           05 FD-NOME        PIC X(30).                                 00109000
           05 FD-VALOR       PIC 9(06)V99 .                             00109100
           05 FD-TIPO        PIC X(01).                                 00109200
                88 FD-BOLEANA               VALUE 'C' 'D'.              00109300
                                                                        00109400
      *===================SAIDACLI=========================             00109500
                                                                        00109600
       FD SAIDACLI                                                      00109700
           RECORDING  MODE IS F                                         00109800
           BLOCK CONTAINS 0 RECORDS.                                    00109900
                                                                        00110000
        01 FD-SAIDACLI.                                                 00110100
           05 FD-AGENCIA-S   PIC 9(04).                                 00110200
           05 FD-CONTA-S     PIC 9(05).                                 00110300
           05 FD-NOME-S      PIC X(30).                                 00110400
           05 FD-VALOR-S     PIC 9(06)V99 .                             00110500
           05 FD-TIPO-S      PIC X(01).                                 00110600
                88 FD-BOLEANA               VALUE 'C' 'D'.              00110700
                                                                        00110800
      *====================================================             00110900
       WORKING-STORAGE                           SECTION.               00111000
      *====================================================             00111100
                                                                        00111200
       77 WRK-STATUS         PIC 9(02).                                 00111300
       77 WRK-STATUS-SAI     PIC 9(02).                                 00111400
                                                                        00111500
      *====================RESULTADOS======================             00111600
                                                                        00111700
      *             SEM CALCULOS NECESSARIOS                            00111800
                                                                        00111900
      *====================FORMATACAO=====================              00112000
                                                                        00112100
       77 WRK-VALOR-EDT      PIC ZZZ.ZZ9,99.                            00112200
                                                                        00112300
      *====================================================             00112400
       PROCEDURE                                 DIVISION.              00112500
      *====================================================             00112600
                                                                        00112700
           PERFORM 1000-INICIO.                                         00112800
                                                                        00112900
           IF WRK-STATUS = 00 AND WRK-STATUS-SAI = 00                   00113000
              PERFORM 2000-PROCESSO UNTIL WRK-STATUS EQUAL 10           00113100
           END-IF.                                                      00113200
                                                                        00113300
           PERFORM 3000-FIM.                                            00113400
                                                                        00113500
      *====================================================             00113600
       1000-INICIO                              SECTION.                00113700
      *====================================================             00113800
                                                                        00113900
                                                                        00114000
      *    RECEBIMENTO DE DADOS                                         00114100
           OPEN INPUT CLIENTES.                                         00114200
                                                                        00114300
              DISPLAY 'ENTRADA ABERTA..' WRK-STATUS.                    00114400
                                                                        00114600
           OPEN OUTPUT SAIDACLI.                                        00114700
                                                                        00114800
              DISPLAY 'SAIDA   ABERTA..' WRK-STATUS-SAI.                00114900
              DISPLAY '----------------------------------------------'. 00115000
           READ CLIENTES                                                00115200
      *====================================================             00115300
       1000-99-FIM.                                 EXIT.               00115400
      *====================================================             00115500
                                                                        00115600
                                                                        00115700
      *====================================================             00115800
       2000-PROCESSO                            SECTION.                00115900
      *====================================================             00116000
                                                                        00120000
                                                                        00120100
           DISPLAY 'STATUS.... ' WRK-STATUS.                            00120400
                                                                        00120500
           IF FD-VALOR > 1000                                           00120600
              DISPLAY 'EMPRESTIMO APROVADO '                            00120700
              MOVE FD-CLIENTES TO FD-SAIDACLI                           00120800
              WRITE FD-SAIDACLI                                         00120900
           ELSE                                                         00121000
              DISPLAY 'EMPRESTIMO NEGADO   '                            00121100
           END-IF.                                                      00121200
                                                                        00121300
           DISPLAY 'REGISTRO.. ' FD-CLIENTES.                           00121400
           DISPLAY '-----------------------------------------------'.   00121500
                                                                        00121600
                                                                        00121800
           READ CLIENTES.                                               00121900
                                                                        00122000
      *====================================================             00122100
       2000-99-FIM.                                 EXIT.               00122200
      *====================================================             00122300
                                                                        00125300
      *====================================================             00125400
       3000-FIM                              SECTION.                   00125500
      *====================================================             00125600
                                                                        00125700
           EVALUATE WRK-STATUS                                          00125800
                                                                        00125900
              WHEN 10                                                   00126000
                CLOSE CLIENTES                                          00126100
                DISPLAY 'FIM DO ARQUIVO ' WRK-STATUS                    00126200
                DISPLAY '-------------------------------------------'   00126300
                                                                        00126400
              WHEN 35                                                   00126500
                DISPLAY 'ARQUIVO NAO ENCONTRADO ' WRK-STATUS            00126600
                DISPLAY '-------------------------------------------'   00126700
                                                                        00126800
              WHEN OTHER                                                00126900
                DISPLAY 'ERRO NO ARQUIVO        ' WRK-STATUS            00127000
                DISPLAY '-------------------------------------------'   00127100
                                                                        00127200
            END-EVALUATE.                                               00127300
                                                                        00127400
                                                                        00127500
            IF WRK-STATUS-SAI = 96                                      00127600
              DISPLAY 'SAIDA NAO ENCONTRADA ' WRK-STATUS-SAI            00127700
              DISPLAY '-------------------------------------------'     00127800
                                                                        00127900
            ELSE                                                        00128000
              CLOSE SAIDACLI                                            00128200
              DISPLAY '-------------------------------------------'     00128800
                                                                        00128900
            END-IF.                                                     00129000
                                                                        00129100
            STOP RUN.                                                   00129700
                                                                        00130000
      *====================================================             00131000
       3000-99-FIM.                                  EXIT.              00132000
      *====================================================             00133000
                                                                        00140000
