      *=============================================================*   00001000
       IDENTIFICATION                            DIVISION.              00002000
      *=============================================================*   00003000
                                                                        00004000
       PROGRAM-ID. BASEARQ1.                                            00005000
                                                                        00006000
      *=============================================================*   00011100
      *   AUTOR....:VICTOR ARANDA                                   *   00011200
      *   ANALISTA.:IVAN PETRUCCI                  - INSTRUTOR      *   00011300
      *   DATA ....:25/05/2022                                      *   00011400
      *-------------------------------------------------------------*   00011500
      *   OBJETIVO:BASE DE LEITURA DE ARQUIVOS                      *   00011600
      *                                                             *   00011700
      *                                                             *   00011800
      *-------------------------------------------------------------*   00011900
      *   ARQUIVOS:                                                 *   00012000
      *    DDNAME              I/O                  COPY/BOOK       *   00012100
      *    ARQUIIN              I                                   *   00012200
      *                                                             *   00012300
      *=============================================================*   00012400
                                                                        00012500
      *=============================================================*   00013000
       ENVIRONMENT                               DIVISION.              00014000
      *=============================================================*   00015000
                                                                        00015100
      *-------------------------------------------------------------*   00015200
       CONFIGURATION                                        SECTION.    00015300
      *-------------------------------------------------------------*   00015400
       SPECIAL-NAMES.                                                   00015500
           DECIMAL-POINT IS COMMA.                                      00015600
                                                                        00015700
                                                                        00015800
       INPUT-OUTPUT                                         SECTION.    00015900
       FILE-CONTROL.                                                    00016000
           SELECT ARQUIIN  ASSIGN TO ARQUIIN                            00016100
               FILE STATUS  IS WRK-FS-ARQUIIN.                          00016200
                                                                        00016300
      *=============================================================*   00016400
       DATA                                                DIVISION.    00016500
      *=============================================================*   00016600
       FILE                                                 SECTION.    00016700
      *=============================================================*   00016800
       FD ARQUIIN                                                       00016900
           RECORDING  MODE IS F                                         00017000
           BLOCK CONTAINS 0 RECORDS.                                    00017100
                                                                        00017200
                                                                        00017300
                                                                        00017400
       01 FD-ARQUIIN.                                                   00017500
          05 FD-CODIGO PIC X(04).                                       00017600
          05 FD-ITEM   PIC X(20).                                       00017700
          05 FD-QUANT  PIC 9(05).                                       00017800
          05 FILLER    PIC X(29).                                       00017900
      *-------------------------------------------------------------*   00018700
       WORKING-STORAGE                                      SECTION.    00019000
      *-------------------------------------------------------------*   00020000
                                                                        00020100
       77 WRK-FS-ARQUIIN  PIC 9(02).                                    00020200
       77 WRK-ACUM-LIDOS  PIC 9(02).                                    00020300
                                                                        00020400
       01 WRK-DADOS.                                                    00020500
           05 WRK-PROGRAMA  PIC X(08).                                  00020600
           05 WRK-SECAO     PIC X(04).                                  00020700
           05 WRK-MENSAGEM  PIC X(30).                                  00020800
           05 WRK-STATUS    PIC X(02).                                  00020900
                                                                        00021000
      *-------------------------------------------------------------*   00021100
       LINKAGE                                              SECTION.    00021200
      *-------------------------------------------------------------*   00021300
                                                                        00021400
       01 LNK-INFO-DATA    PIC X(31).                                   00021500
                                                                        00021600
                                                                        00021700
                                                                        00021800
                                                                        00021900
      *=============================================================*   00022000
       PROCEDURE DIVISION USING LNK-INFO-DATA.                          00023000
      *=============================================================*   00024000
                                                                        00024100
      *=============================================================*   00024200
       0000-PRINCIPAL                                       SECTION.    00024300
      *=============================================================*   00024400
                                                                        00024500
            PERFORM 1000-INICIAR.                                       00024600
            PERFORM 2000-PROCESSAR UNTIL WRK-FS-ARQUIIN EQUAL 10.       00024700
            PERFORM 3000-FINALIZAR.                                     00024800
            STOP RUN.                                                   00024900
                                                                        00025000
      *=============================================================*   00025100
       0000-99-FIM.                                            EXIT.    00025200
      *=============================================================*   00025300
                                                                        00025400
                                                                        00025500
                                                                        00025600
      *=============================================================*   00025700
       1000-INICIAR                                         SECTION.    00025800
      *=============================================================*   00025900
                                                                        00026000
            OPEN INPUT ARQUIIN.                                         00026100
              PERFORM 1100-TESTARSTATUS.                                00026200
               READ ARQUIIN.                                            00026300
                                                                        00026400
      *=============================================================*   00026800
       1000-99-FIM.                                            EXIT.    00026900
      *=============================================================*   00027000
                                                                        00027100
                                                                        00027200
                                                                        00027300
      *=============================================================*   00027400
       1100-TESTARSTATUS                                    SECTION.    00027500
      *=============================================================*   00027600
                                                                        00027700
               IF WRK-FS-ARQUIIN  NOT EQUAL 0                           00027800
                MOVE 'BASEARQ1'              TO WRK-PROGRAMA            00027900
                MOVE '1000'                  TO WRK-SECAO               00028000
                MOVE 'ERRO OPEN PRODUTOS - ' TO WRK-MENSAGEM            00028100
                MOVE WRK-FS-ARQUIIN          TO WRK-STATUS              00028200
                   PERFORM 9000-TRATARERROS                             00028300
               END-IF.                                                  00028400
                                                                        00028500
      *=============================================================*   00028600
       1100-99-FIM.                                            EXIT.    00028700
      *=============================================================*   00028800
                                                                        00028900
                                                                        00029000
                                                                        00029100
      *=============================================================*   00029200
       2000-PROCESSAR                                       SECTION.    00029300
      *=============================================================*   00029400
                                                                        00029500
             ADD 1 TO WRK-ACUM-LIDOS.                                   00029600
                IF WRK-FS-ARQUIIN EQUAL 10                              00029700
                  DISPLAY ' FINAL DE ARQUIVO'                           00029800
                ELSE                                                    00029900
                  DISPLAY FD-ARQUIIN                                    00030000
                END-IF.                                                 00030100
               READ ARQUIIN.                                            00030200
                                                                        00030300
      *=============================================================*   00030400
       2000-99-FIM.                                            EXIT.    00030500
      *=============================================================*   00030600
                                                                        00030700
                                                                        00030800
                                                                        00030900
      *=============================================================*   00031000
       3000-FINALIZAR                                       SECTION.    00031100
      *=============================================================*   00031200
                                                                        00031300
               CLOSE ARQUIIN.                                           00031600
               DISPLAY 'LIDOS.... ' WRK-ACUM-LIDOS.                     00031700
               CALL 'DATAEXT' USING LNK-INFO-DATA.                      00031800
               DISPLAY LNK-INFO-DATA.                                   00031900
                                                                        00032000
      *=============================================================*   00032100
       3000-99-FIM.                                            EXIT.    00032200
      *=============================================================*   00032300
                                                                        00032400
                                                                        00032500
                                                                        00032600
      *=============================================================*   00032700
       9000-TRATARERROS                                     SECTION.    00032800
      *=============================================================*   00032900
                                                                        00033000
             CALL 'GRAVALOG' USING WRK-DADOS.                           00034000
                 GOBACK.                                                00040000
                                                                        00041000
      *=============================================================*   00050000
       9000-99-FIM.                                            EXIT.    00060000
      *=============================================================*   00070000
