       01 WRK-SVSA0407-DADOS.
          05 WRK-CABECALHO.
             10 WRK-SVSA0407-DADOS-BOOK  PIC X(08) VALUE 'I#BV0407'.
             10 WRK-SVSA0407-DADOS-LEN   PIC 9(03) VALUE 27.
          05 WRK-CORPO.
             10 WRK-SVSA0407-DADOS-AGENCIA      PIC X(04).
             10 WRK-SVSA0407-DADOS-CONTA        PIC X(05).
             10 WRK-SVSA0407-DADOS-SALARIO      PIC X(10).
             10 WRK-SVSA0407-DADOS-DATA         PIC X(08).

