       IDENTIFICATION                            DIVISION.              00010000
       PROGRAM-ID.  FR01CB01.                                           00020000
      *=============================================================*   00020101
      *   AUTOR....:VICTOR ARANDA                                   *   00020201
      *   ANALISTA.:IVAN PETRUCCI                  - INSTRUTOR      *   00020301
      *   DATA ....:02/04/2022                                      *   00020401
      *-------------------------------------------------------------*   00020501
      *   OBJETIVO:PRIMEIRO PROGRAMA                                *   00020601
      *                                                             *   00020701
      *                                                             *   00020801
      *-------------------------------------------------------------*   00020901
      *   ARQUIVOS:                                                 *   00021001
      *    DDNAME              I/O                  COPY/BOOK       *   00021101
      *                                                             *   00021201
      *                                                             *   00022001
      *=============================================================*   00023001
       PROCEDURE DIVISION.                                              00050000
           DISPLAY 'MEU PRIMEIRO PROGRAMA - VICTOR'.                    00060001
           STOP RUN.                                                    00070001
