      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR21CB12.                                            00040000
      *=============================================================*   00050000
      *   AUTOR....:VICTOR ARANDA                                   *   00051000
      *   ANALISTA.:IVAN PETRUCCI                  - INSTRUTOR      *   00052000
      *   DATA ....:11/06/2022                                      *   00053000
      *-------------------------------------------------------------*   00054000
      *   OBJETIVO:VARIAVEL BOLEANA                                *    00055000
      *                                                             *   00056000
      *                                                             *   00057000
      *-------------------------------------------------------------*   00058000
      *   ARQUIVOS:                                                 *   00059000
      *    DDNAME              I/O                  COPY/BOOK       *   00059100
      *                                                             *   00059200
      *                                                             *   00060000
      *=============================================================*   00070000
       ENVIRONMENT                               DIVISION.              00102000
      *====================================================             00103000
       CONFIGURATION                             SECTION .              00104000
                                                                        00104100
       SPECIAL-NAMES.                                                   00104200
           DECIMAL-POINT IS COMMA.                                      00104300
      *====================================================             00105000
       DATA                                      DIVISION.              00106000
      *====================================================             00107000
       WORKING-STORAGE                            SECTION.              00108000
                                                                        00108200
       01 WRK-DADOS.                                                    00108300
          05 WRK-DATA.                                                  00108400
            10 WRK-DIA        PIC X(02)    VALUE SPACES.                00108500
            10 WRK-MES        PIC X(02)    VALUE SPACES.                00108600
            10 WRK-ANO        PIC X(04)    VALUE SPACES.                00108700
                                                                        00108800
          05 WRK-VALOR      PIC 9(05)V99 VALUE ZEROS.                   00108900
          05 WRK-LANCAMENTO PIC X(30)    VALUE SPACES.                  00109000
          05 WRK-TIPO       PIC X(01)    VALUE SPACES.                  00109100
            88 WRK-BOLEANA               VALUE 'C' 'D'.                 00109200
                                                                        00109300
      *====================RESULTADOS======================             00109400
                                                                        00109500
      *             SEM CALCULOS NECESSARIOS                            00109600
                                                                        00109700
      *====================FORMATACAO=====================              00109900
                                                                        00110000
       77 WRK-VALOR-EDT    PIC ZZ.ZZ9,99.                               00110600
                                                                        00110700
      *====================================================             00110800
       PROCEDURE                                 DIVISION.              00110900
      *====================================================             00111000
                                                                        00111100
           PERFORM 1000-INICIO.                                         00111200
           PERFORM 2000-PROCESSO.                                       00111300
           PERFORM 3000-FIM.                                            00111400
                                                                        00111500
      *====================================================             00111600
       1000-INICIO                              SECTION.                00111700
      *====================================================             00111800
                                                                        00111900
                                                                        00112000
      *    RECEBIMENTO DE DADOS                                         00112100
           ACCEPT WRK-DADOS FROM SYSIN.                                 00112200
                                                                        00112300
                                                                        00112400
                                                                        00112500
      *====================================================             00112600
       1000-99-FIM.                                 EXIT.               00112700
      *====================================================             00112800
                                                                        00112900
                                                                        00113000
      *====================================================             00113100
       2000-PROCESSO                            SECTION.                00113200
      *====================================================             00113300
                                                                        00113400
           IF WRK-BOLEANA                                               00113500
                                                                        00113600
             MOVE WRK-VALOR TO WRK-VALOR-EDT                            00113700
                                                                        00114000
             DISPLAY 'DATA.....' WRK-DIA '/' WRK-MES '/' WRK-ANO        00114100
             DISPLAY 'VALOR....' WRK-VALOR-EDT                          00114200
             DISPLAY 'TITULO...' WRK-LANCAMENTO                         00114300
                                                                        00114400
                IF WRK-TIPO EQUAL 'C'                                   00114500
                                                                        00114600
                   DISPLAY 'CREDITO'                                    00114700
                ELSE                                                    00115000
                                                                        00115100
                   DISPLAY 'DEBITO'                                     00116000
                END-IF                                                  00117000
                                                                        00117100
           ELSE                                                         00118000
             DISPLAY 'DADOS INVALIDOS'                                  00119000
                                                                        00119100
           END-IF.                                                      00119500
                                                                        00119600
      *====================================================             00119700
       2000-99-FIM.                                 EXIT.               00119800
      *====================================================             00119900
                                                                        00120000
                                                                        00120100
      *====================================================             00120200
       3000-FIM                                   SECTION.              00120300
      *====================================================             00120400
                                                                        00120500
           STOP RUN.                                                    00121000
                                                                        00130000
      *====================================================             00131000
       3000-99-FIM.                                  EXIT.              00132000
      *====================================================             00133000
                                                                        00140000
