      *=============================================================*   00001000
       IDENTIFICATION                            DIVISION.              00002000
      *=============================================================*   00003000
                                                                        00004000
       PROGRAM-ID. FR21DB03.                                            00005031
                                                                        00006000
      *=============================================================*   00007000
      *   AUTOR....:VICTOR ARANDA                                   *   00007124
      *   ANALISTA.:IVAN PETRUCCI                  - INSTRUTOR      *   00007200
      *   DATA ....:30/05/2022                                      *   00007300
      *-------------------------------------------------------------*   00007400
      *   OBJETIVO: INSERT EM TABELA DB2                           *    00007538
      *                                                             *   00007824
      *-------------------------------------------------------------*   00007900
      *   ARQUIVOS...:                                              *   00008000
      *    DDNAME              I/O                 INCLUDE/BOOK     *   00008100
      *   IVAN.FUNC             I                  #BKFUNC----      *   00008216
      *-------------------------------------------------------------*   00008300
      *   MODULOS....:                             INCLUDE/BOOK     *   00008400
      *=============================================================*   00008500
                                                                        00008600
      *=============================================================*   00008700
       ENVIRONMENT                               DIVISION.              00008800
      *=============================================================*   00008900
                                                                        00009000
      *=============================================================*   00009100
       CONFIGURATION                               SECTION.             00009200
      *=============================================================*   00009300
       SPECIAL-NAMES.                                                   00009400
           DECIMAL-POINT IS COMMA.                                      00009500
                                                                        00009600
      *=============================================================*   00009700
       DATA                                      DIVISION.              00009800
      *=============================================================*   00009900
      *=============================================================*   00010000
       WORKING-STORAGE                             SECTION.             00011000
      *=============================================================*   00020000
                                                                        00021000
           EXEC SQL                                                     00022000
              INCLUDE #BKFUNC                                           00023000
           END-EXEC.                                                    00023100
                                                                        00023200
           EXEC SQL                                                     00023300
              INCLUDE SQLCA                                             00023400
           END-EXEC.                                                    00023500
                                                                        00023724
                                                                        00024324
                                                                        00024424
      *-------------------------------------------------------------*   00024524
       77 WRK-SQLCODE PIC -999.                                         00024631
                                                                        00024831
       01 WRK-ID.                                                       00024931
          02 FILLER           PIC X(10).                                00025031
          02 WRK-ID-AC        PIC 9(04).                                00025131
                                                                        00025231
                                                                        00025331
       01 WRK-NOME.                                                     00025431
          02 FILLER           PIC X(10).                                00025531
          02 WRK-NOME-AC      PIC X(30).                                00025632
                                                                        00025731
       01 WRK-SETOR.                                                    00025831
          02 FILLER           PIC X(10).                                00025931
          02 WRK-SETOR-AC     PIC X(04).                                00026031
                                                                        00026131
                                                                        00026231
       01 WRK-SALARIO.                                                  00026331
          02 FILLER           PIC X(10).                                00026431
          02 WRK-SALARIO-AC   PIC 9(08)V99.                             00026531
                                                                        00026631
       01 WRK-DATAADM.                                                  00026732
          02 FILLER           PIC X(10).                                00026831
          02 WRK-DATAADM-AC   PIC X(10).                                00026931
                                                                        00027031
                                                                        00027131
       01 WRK-EMAIL.                                                    00027231
          02 FILLER           PIC X(10).                                00027331
          02 WRK-EMAIL-AC     PIC X(40).                                00027431
                                                                        00027524
                                                                        00027631
                                                                        00027718
      *=============================================================*   00027818
       PROCEDURE DIVISION.                                              00027900
      *=============================================================*   00028000
                                                                        00028100
      *-------------------------------------------------------------*   00028200
       0000-PRINCIPAL                           SECTION.                00028300
      *-------------------------------------------------------------*   00028400
                                                                        00028500
            PERFORM  1000-INICIAR.                                      00028600
            PERFORM  2000-PROCESSAR.                                    00028731
            PERFORM  3000-FINALIZAR.                                    00028800
                                                                        00028931
                                                                        00029000
      *-------------------------------------------------------------*   00029100
       1000-INICIAR                             SECTION.                00029200
      *-------------------------------------------------------------*   00029300
                                                                        00029724
           ACCEPT WRK-ID.                                               00029831
           ACCEPT WRK-NOME.                                             00029931
           ACCEPT WRK-SETOR.                                            00030031
           ACCEPT WRK-SALARIO.                                          00030131
           ACCEPT WRK-DATAADM.                                          00030231
           ACCEPT WRK-EMAIL.                                            00030331
                                                                        00031431
       1000-99-FIM.              EXIT.                                  00031531
      *-------------------------------------------------------------*   00031631
       2000-PROCESSAR                           SECTION.                00031731
      *-------------------------------------------------------------*   00031831
           MOVE  WRK-ID-AC       TO DB2-ID.                             00032033
           MOVE  WRK-NOME-AC     TO DB2-NOME.                           00034234
           MOVE  WRK-SETOR-AC    TO DB2-SETOR.                          00034334
           MOVE  WRK-SALARIO-AC  TO DB2-SALARIO.                        00034434
           MOVE  WRK-DATAADM-AC  TO DB2-DATAADM.                        00034534
           MOVE  WRK-EMAIL-AC    TO DB2-EMAIL.                          00034634
                                                                        00034833
           EXEC SQL                                                     00034933
            INSERT INTO                                                 00035033
             IVAN.FUNC(ID,NOME,SETOR,SALARIO,DATAADM,EMAIL)             00036137
             VALUES(:DB2-ID,                                            00036237
                    :DB2-NOME,                                          00036337
                    :DB2-SETOR,                                         00036437
                    :DB2-SALARIO,                                       00036537
                    :DB2-DATAADM,                                       00036637
                    :DB2-EMAIL)                                         00036737
           END-EXEC.                                                    00036837
                                                                        00036937
       2000-99-FIM.              EXIT.                                  00037037
      *-------------------------------------------------------------*   00038037
      *-------------------------------------------------------------*   00039600
       3000-FINALIZAR                               SECTION.            00039700
      *-------------------------------------------------------------*   00039800
                                                                        00039934
           EVALUATE SQLCODE                                             00040033
             WHEN 0                                                     00040133
              DISPLAY   'DADOS GRAVADOS'                                00041033
              DISPLAY   'ID.....'    DB2-ID                             00041133
              DISPLAY   'NOME...'    DB2-NOME                           00041233
              DISPLAY   'SETOR..'    DB2-SETOR                          00041333
              DISPLAY   'SALARIO'    DB2-SALARIO                        00041433
              DISPLAY   'DATAADM'    DB2-DATAADM                        00041533
              DISPLAY   'EMAIL..'    DB2-EMAIL                          00041633
             WHEN OTHER                                                 00041733
              MOVE SQLCODE    TO WRK-SQLCODE                            00041836
              DISPLAY 'ERRO....' WRK-SQLCODE                            00041933
             END-EVALUATE.                                              00042033
                                                                        00042134
              DISPLAY 'FIM DO PROGRAMA'.                                00042233
              STOP RUN.                                                 00042333
                                                                        00042433
       3000-99-FIM.              EXIT.                                  00042533
      *-------------------------------------------------------------*   00043019
      *-------------------------------------------------------------*   00043919
       9000-TRATAERROS                              SECTION.            00044019
                                                                        00044131
                                                                        00045000
       9000-99-FIM.              EXIT.                                  00050000
