      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR21CB11.                                            00040000
      *=============================================================*   00050000
      *   AUTOR....:VICTOR ARANDA                                   *   00051000
      *   ANALISTA.:IVAN PETRUCCI                  - INSTRUTOR      *   00052000
      *   DATA ....:10/06/2022                                      *   00053000
      *-------------------------------------------------------------*   00054000
      *   OBJETIVO: CALCULAR A MEDIA DOS ALUNOS                     *   00055000
      *                                                             *   00056000
      *                                                             *   00057000
      *-------------------------------------------------------------*   00058000
      *   ARQUIVOS:                                                 *   00059000
      *    DDNAME              I/O                  COPY/BOOK       *   00059100
      *                                                             *   00060000
      *                                                             *   00070000
      *=============================================================*   00080000
       ENVIRONMENT                               DIVISION.              00102000
      *====================================================             00103000
       CONFIGURATION                             SECTION .              00104000
                                                                        00104100
       SPECIAL-NAMES.                                                   00104200
           DECIMAL-POINT IS COMMA.                                      00104300
      *====================================================             00105000
       DATA                                      DIVISION.              00106000
      *====================================================             00107000
       WORKING-STORAGE                            SECTION.              00108000
                                                                        00108200
       01 WRK-DADOS.                                                    00108300
          05 WRK-NOTA1      PIC 9(04)V99 VALUE ZEROS.                   00108400
          05 WRK-NOTA2      PIC 9(04)V99 VALUE ZEROS.                   00108600
                                                                        00108900
      *====================RESULTADOS======================             00109000
                                                                        00109100
                                                                        00109200
       77 WRK-MEDIA         PIC 9(04)V99 VALUE ZEROS.                   00109300
                                                                        00109400
                                                                        00109600
                                                                        00109800
      *====================FORMATACAO=====================              00109900
                                                                        00110000
      *             SEM FORMATACAO NECESSARIA                           00110100
                                                                        00110600
      *====================================================             00110700
       PROCEDURE                                 DIVISION.              00110800
      *====================================================             00110900
                                                                        00111000
           PERFORM 1000-INICIO.                                         00111100
           PERFORM 2000-PROCESSO.                                       00111200
           PERFORM 3000-FIM.                                            00111300
                                                                        00111400
      *====================================================             00111500
       1000-INICIO                              SECTION.                00111600
      *====================================================             00111700
                                                                        00111800
                                                                        00111900
      *    RECEBIMENTO DE DADOS                                         00112000
           ACCEPT WRK-DADOS FROM SYSIN.                                 00112100
                                                                        00112200
                                                                        00112300
                                                                        00112400
      *====================================================             00112500
       1000-99-FIM.                                 EXIT.               00112600
      *====================================================             00112700
                                                                        00112800
                                                                        00112900
      *====================================================             00113000
       2000-PROCESSO                            SECTION.                00113100
      *====================================================             00113200
                                                                        00113300
           DISPLAY 'NOTA 1' WRK-NOTA1.                                  00113400
           DISPLAY 'NOTA 2' WRK-NOTA2.                                  00113500
                                                                        00115500
           COMPUTE WRK-MEDIA = ( WRK-NOTA1 + WRK-NOTA2 ) / 2.           00115600
                                                                        00115700
           DISPLAY 'MEDIA ' WRK-MEDIA.                                  00115800
                                                                        00115900
           EVALUATE WRK-MEDIA                                           00116000
             WHEN WRK-MEDIA > 10                                        00116100
              DISPLAY 'MEDIA ERRADA '                                   00116200
                                                                        00117000
             WHEN WRK-MEDIA >= 9 AND WRK-MEDIA <= 10                    00117200
              DISPLAY 'APROVADO COM LOUVOR'                             00117300
                                                                        00117400
             WHEN WRK-MEDIA < 9 AND WRK-MEDIA >= 6                      00117500
              DISPLAY 'APROVADO     '                                   00117600
                                                                        00118000
             WHEN WRK-MEDIA < 6 AND WRK-MEDIA >= 2                      00118100
              DISPLAY 'RECUPERACAO  '                                   00118200
                                                                        00118300
             WHEN WRK-MEDIA < 2                                         00118400
              DISPLAY 'REPROVADO    '                                   00118500
                                                                        00118600
           END-EVALUATE.                                                00119000
                                                                        00119100
                                                                        00119500
      *====================================================             00119600
       2000-99-FIM.                                 EXIT.               00119700
      *====================================================             00119800
                                                                        00119900
                                                                        00120000
      *====================================================             00120100
       3000-FIM                                   SECTION.              00120200
      *====================================================             00120300
                                                                        00120400
           STOP RUN.                                                    00121000
                                                                        00130000
      *====================================================             00131000
       3000-99-FIM.                                  EXIT.              00132000
      *====================================================             00133000
                                                                        00140000
