      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR21CB05.                                            00040000
      *=============================================================*   00050000
      *   AUTOR....:VICTOR ARANDA                                   *   00051000
      *   ANALISTA.:IVAN PETRUCCI                  - INSTRUTOR      *   00052000
      *   DATA ....:03/06/2022                                      *   00053000
      *-------------------------------------------------------------*   00054000
      *   OBJETIVO:REDEFINE DE DADOS E ACCEPT DE DADOS EM STRING    *   00055000
      *                                                             *   00056000
      *                                                             *   00057000
      *-------------------------------------------------------------*   00058000
      *   ARQUIVOS:                                                 *   00059000
      *    DDNAME              I/O                  COPY/BOOK       *   00060000
      *                                                             *   00070000
      *                                                             *   00080000
      *=============================================================*   00090000
                                                                        00100000
      *====================================================             00101000
       ENVIRONMENT                               DIVISION.              00102000
      *====================================================             00103000
                                                                        00104000
      *====================================================             00105000
       DATA                                      DIVISION.              00106000
      *====================================================             00107000
       WORKING-STORAGE                           SECTION.               00108000
                                                                        00108100
       01 WRK-DADOS.                                                    00108200
          05 WRK-ID         PIC 9(05) VALUE ZEROS.                      00108300
          05 WRK-NOME       PIC X(20) VALUE SPACES.                     00108400
          05 WRK-ENDERECO   PIC X(40) VALUE SPACES.                     00108500
                                                                        00108600
          05 WRK-ENDERECO1 REDEFINES WRK-ENDERECO.                      00108700
             07 WRK-RUA    PIC X(16).                                   00108800
             07 WRK-NUMERO PIC X(04).                                   00108900
             07 WRK-BAIRRO PIC X(10).                                   00109000
             07 WRK-CIDADE PIC X(10).                                   00109100
                                                                        00109200
      *====================================================             00110600
       PROCEDURE                                 DIVISION.              00110700
      *====================================================             00111000
           ACCEPT   WRK-DADOS   FROM  SYSIN.                            00120000
           DISPLAY 'WRK-DADOS.......' WRK-DADOS.                        00130000
           DISPLAY 'ENDERECO........' WRK-ENDERECO.                     00131000
           DISPLAY 'BAIRRO..........' WRK-BAIRRO.                       00131400
           STOP RUN.                                                    00131500
