      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR21CB13.                                            00040000
      *=============================================================*   00050000
      *   AUTOR....:VICTOR ARANDA                                   *   00051000
      *   ANALISTA.:IVAN PETRUCCI                  - INSTRUTOR      *   00052000
      *   DATA ....:12/06/2022                                      *   00053001
      *-------------------------------------------------------------*   00054000
      *   OBJETIVO:REDEFINE DE DADOS                                *   00055000
      *                                                             *   00056000
      *                                                             *   00057000
      *-------------------------------------------------------------*   00060000
      *   ARQUIVOS:                                                 *   00070000
      *    DDNAME              I/O                  COPY/BOOK       *   00080000
      *                                                             *   00090000
      *                                                             *   00100000
      *=============================================================*   00101000
       ENVIRONMENT                               DIVISION.              00102000
      *====================================================             00103000
       CONFIGURATION                             SECTION .              00104000
                                                                        00104100
       SPECIAL-NAMES.                                                   00104200
           DECIMAL-POINT IS COMMA.                                      00104300
      *====================================================             00105000
       DATA                                      DIVISION.              00106000
      *====================================================             00107000
       WORKING-STORAGE                            SECTION.              00108000
                                                                        00108200
       01 WRK-DADOS.                                                    00108300
          05 WRK-N1         PIC 9(02)  VALUE ZEROS.                     00108400
          05 WRK-TIPO       PIC X(01)  VALUE SPACE.                     00108500
             88 WRK-BOLEANA            VALUE 'C' 'D'.                   00108600
                                                                        00108700
                                                                        00108800
       77 WRK-CONTADOR      PIC  9(02)  VALUE ZEROS.                    00109400
       77 WRK-FATOR         PIC S9(02)  VALUE ZEROS.                    00109500
       77 WRK-RESULTADOS    PIC  9(03)  VALUE ZEROS.                    00109600
       77 WRK-SOMATORIA     PIC  9(03)  VALUE ZEROS.                    00109800
      *====================RESULTADOS======================             00109900
                                                                        00110000
      *             SEM CALCULOS NECESSARIOS                            00110100
                                                                        00110200
      *====================FORMATACAO=====================              00110300
                                                                        00110400
      *             SEM FORMATACAO NECESSARAS                           00110500
                                                                        00110700
      *====================================================             00110800
       PROCEDURE                                 DIVISION.              00110900
      *====================================================             00111000
                                                                        00111100
           PERFORM 1000-INICIO.                                         00111200
           PERFORM 2000-PROCESSO.                                       00111300
           PERFORM 2300-SOMATORIA                                       00111500
           PERFORM 3000-FIM.                                            00111600
                                                                        00111700
      *====================================================             00111800
       1000-INICIO                              SECTION.                00111900
      *====================================================             00112000
                                                                        00112100
                                                                        00112200
      *    RECEBIMENTO DE DADOS                                         00112300
           ACCEPT WRK-DADOS FROM SYSIN.                                 00112400
                                                                        00112500
                                                                        00112600
                                                                        00112700
      *====================================================             00112800
       1000-99-FIM.                                 EXIT.               00112900
      *====================================================             00113000
                                                                        00113100
                                                                        00113200
      *====================================================             00113300
       2000-PROCESSO                            SECTION.                00113400
      *====================================================             00113500
                                                                        00113600
           IF WRK-BOLEANA                                               00113700
                                                                        00113800
             IF WRK-TIPO = 'D'                                          00113900
               MOVE 10 TO WRK-CONTADOR                                  00114000
               MOVE -1 TO WRK-FATOR                                     00114100
               PERFORM 2100-CALCULO 10 TIMES                            00114200
                                                                        00114400
             ELSE                                                       00115100
               MOVE 1 TO WRK-CONTADOR                                   00115200
               MOVE 1 TO WRK-FATOR                                      00115300
               PERFORM 2100-CALCULO 10 TIMES                            00115400
             END-IF                                                     00115700
                                                                        00115800
           ELSE                                                         00115900
             DISPLAY 'OPERACAO ERRADA'                                  00116000
           END-IF.                                                      00116100
                                                                        00116200
                                                                        00119600
      *====================================================             00119700
       2000-99-FIM.                                 EXIT.               00119800
      *====================================================             00119900
                                                                        00120000
      *====================================================             00120100
       2100-CALCULO                          SECTION.                   00120200
      *====================================================             00120300
                                                                        00120400
           COMPUTE WRK-RESULTADOS = WRK-N1 * WRK-CONTADOR.              00120500
           DISPLAY WRK-RESULTADOS.                                      00120600
           ADD WRK-RESULTADOS TO WRK-SOMATORIA.                         00120700
           ADD WRK-FATOR      TO WRK-CONTADOR.                          00120800
                                                                        00120900
                                                                        00121000
                                                                        00121100
      *====================================================             00121200
       2100-99-FIM.                                 EXIT.               00121300
      *====================================================             00121400
                                                                        00121500
                                                                        00122600
      *====================================================             00122700
       2200-99-FIM.                                 EXIT.               00122800
      *====================================================             00122900
                                                                        00123000
      *====================================================             00123100
       2300-SOMATORIA                       SECTION.                    00123200
      *====================================================             00123300
                                                                        00123400
           DISPLAY WRK-SOMATORIA.                                       00123500
                                                                        00123600
                                                                        00123700
      *====================================================             00123800
       2300-99-FIM.                                 EXIT.               00123900
      *====================================================             00124000
                                                                        00124100
      *====================================================             00124200
       3000-FIM                                   SECTION.              00124300
      *====================================================             00124400
                                                                        00124500
           STOP RUN.                                                    00125000
                                                                        00130000
      *====================================================             00131000
       3000-99-FIM.                                  EXIT.              00132000
      *====================================================             00133000
                                                                        00140000
