      *===================================================              00010000
       IDENTIFICATION                            DIVISION.              00020000
      *===================================================              00030000
                                                                        00031000
       PROGRAM-ID. F21CIP2.                                             00032054
      *=============================================================*   00033015
      *   AUTOR....:VICTOR ARANDA                                   *   00033115
      *   ANALISTA.:IVAN PETRUCCI                  - INSTRUTOR      *   00033215
      *   DATA ....:22/06/2022                                      *   00033315
      *-------------------------------------------------------------*   00033415
      *   OBJETIVO:FAZER UMA CONSULTA DE FUNCIONARIO PELO CICS      *   00033515
      *            UTILIZANDO UM ARQUIVO VISAM                      *   00033654
      *                                                             *   00033715
      *-------------------------------------------------------------*   00033815
      *   BASE DE DADOS:                                            *   00033915
      *   TABELA.DB2..         I/O                                  *   00034015
      *                                           INCLUDE/BOOK      *   00034115
      *                                            -----------      *   00034215
      *                                                             *   00034315
      *-------------------------------------------------------------*   00034415
      *   ARQUIVOS:                                                 *   00034515
      *    DDNAME              I/O                  COPY/BOOK       *   00034615
      *                                            -----------      *   00034715
      *=============================================================*   00035015
                                                                        00040400
      *===================================================              00040500
       ENVIRONMENT                               DIVISION.              00040600
      *===================================================              00040700
       CONFIGURATION                              SECTION.              00040800
       SPECIAL-NAMES.                                                   00040900
           DECIMAL-POINT IS COMMA.                                      00041030
                                                                        00042000
      *===================================================              00043000
       DATA                                      DIVISION.              00044000
      *==================================================               00044100
       WORKING-STORAGE                            SECTION.              00044200
                                                                        00044300
           COPY F21CIM1.                                                00045615
           COPY DFHAID.                                                 00045715
                                                                        00046115
        77 WRK-STATUS        PIC S9(04) COMP.                           00047154
        77 WRK-STATUS-MAP    PIC S9(04) COMP.                           00047363
        77 WRK-FLAG          PIC 9(1).                                  00047463
        77 WRK-SAIDA         PIC X(30) VALUE '----FIM DE PROGRAMA'.     00047566
        77 WRK-FASE          PIC 9.                                     00047675
                                                                        00047763
        77 WRK-SALARIO-ED    PIC ZZ.ZZZ.ZZ9,99.                         00047855
                                                                        00047930
        01 WRK-DATA.                                                    00048030
           05 WRK-DIA    PIC X(02).                                     00048160
           05 FILLER     PIC X(01) VALUE '-'.                           00048262
           05 WRK-MES    PIC X(02).                                     00048337
           05 FILLER     PIC X(01) VALUE '-'.                           00048462
           05 WRK-ANO    PIC X(04).                                     00048560
                                                                        00048630
        01 WRK-DADOS.                                                   00048855
           05 WRK-CHAVE     PIC 9(05).                                  00048968
           05 WRK-NOME      PIC X(30).                                  00049055
           05 WRK-SETOR     PIC X(04).                                  00049155
           05 WRK-SALARIO   PIC 9(08)V99.                               00049274
           05 WRK-DATAADM   PIC X(10).                                  00049355
           05 WRK-EMAIL     PIC X(40).                                  00049472
                                                                        00049554
      *===================================================              00049630
       PROCEDURE                                 DIVISION.              00049730
      *===================================================              00049830
      *---------------------------------------------------              00049930
       0000-PRINCIPAL                              SECTION.             00050030
      *---------------------------------------------------              00050130
            PERFORM 1000-INICIALIZAR.                                   00050230
                                                                        00050363
            IF EIBCALEN NOT EQUAL 0                                     00050475
               PERFORM 2000-PROCESSAR                                   00050563
            END-IF.                                                     00050663
                                                                        00050763
            PERFORM 3000-FINALIZAR.                                     00050863
                                                                        00050964
                                                                        00051075
            EXEC CICS                                                   00051176
                 RETURN TRANSID('T212')                                 00051276
                 COMMAREA(WRK-FASE)                                     00051376
            END-EXEC.                                                   00051476
      *---------------------------------------------------              00051530
       0000-99-FIM.                                EXIT.                00051630
      *----------------------------------------------------             00051730
       1000-INICIALIZAR                          SECTION.               00051830
      *----------------------------------------------------             00051930
           IF EIBCALEN EQUAL 0                                          00052276
               EXEC CICS SEND                                           00052376
                    MAPSET('F21CIM1')                                   00052476
                    MAP('MAPA01')                                       00052576
                    ERASE                                               00052776
                    MAPONLY                                             00052876
               END-EXEC                                                 00052976
                                                                        00053077
               MOVE 1 TO WRK-FASE                                       00053176
           END-IF.                                                      00053477
                                                                        00053863
      *---------------------------------------------------              00053963
       1000-99-FIM.                                EXIT.                00054063
      *----------------------------------------------------             00054163
      *-----------------------------------------------------            00054263
       2000-PROCESSAR                            SECTION.               00054363
      *-----------------------------------------------------            00054463
           EXEC CICS RECEIVE                                            00054576
                MAPSET('F21CIM1')                                       00054676
                MAP('MAPA01')                                           00054776
                INTO(MAPA01I)                                           00054876
                RESP(WRK-STATUS-MAP)                                    00054976
           END-EXEC.                                                    00055076
                                                                        00055176
           EVALUATE TRUE                                                00055263
               WHEN EIBAID = '5'                                        00055363
                    PERFORM 2100-PESQUISAR                              00056038
                                                                        00060837
               WHEN EIBAID = '6'                                        00060938
                    PERFORM 2400-VALIDACAO                              00061043
                    PERFORM 2200-INSERIR                                00061257
                                                                        00061558
                                                                        00061643
               WHEN EIBAID = '7'                                        00061741
                    PERFORM 2300-DELETAR                                00061841
                                                                        00061941
      *                      SAIR DO PROGRAMA                           00062037
               WHEN EIBAID = '3'                                        00062138
                    EXEC CICS SEND                                      00062263
                         FROM(WRK-SAIDA)                                00062363
                         ERASE                                          00062463
                    END-EXEC                                            00062563
                                                                        00062663
                    EXEC CICS                                           00062763
                         RETURN                                         00062863
                    END-EXEC                                            00062963
                                                                        00063263
      *                     LIMPAR A TELA                               00063363
               WHEN EIBAID = ''''                                       00063465
                    INITIALIZE MAPA01I                                  00063667
                                                                        00063838
            END-EVALUATE.                                               00063938
                                                                        00064037
           EXEC CICS SEND                                               00064181
                MAPSET('F21CIM1')                                       00064281
                MAP('MAPA01')                                           00064381
                DATAONLY                                                00064481
                FROM(MAPA01O)                                           00064581
           END-EXEC.                                                    00064681
      *---------------------------------------------------              00064837
       2000-99-FIM.                                EXIT.                00064937
      *----------------------------------------------------             00065037
      *--------------------------------------------------               00065137
       2100-PESQUISAR                            SECTION.               00065237
      *--------------------------------------------------               00065337
                                                                        00065437
           MOVE IDI TO WRK-CHAVE.                                       00065554
                                                                        00065654
           EXEC CICS READ                                               00065754
                FILE('FUNC')                                            00065854
                RIDFLD(WRK-CHAVE)                                       00065954
                INTO(WRK-DADOS)                                         00066054
                RESP(WRK-STATUS)                                        00066156
           END-EXEC.                                                    00066254
                                                                        00066354
           IF WRK-STATUS EQUAL DFHRESP(NORMAL)                          00066454
              MOVE WRK-NOME     TO NOMEO                                00066554
              MOVE WRK-SETOR    TO SETORO                               00066654
              MOVE WRK-SALARIO  TO WRK-SALARIO-ED                       00066755
              MOVE WRK-DATAADM  TO WRK-DATA                             00066855
              MOVE WRK-ANO      TO DATAANOO                             00066957
              MOVE WRK-MES      TO DATAMESO                             00067057
              MOVE WRK-DIA      TO DATADIAO                             00067157
                                                                        00067255
                                                                        00067355
              MOVE WRK-EMAIL    TO EMAILO                               00067454
              IF WRK-SALARIO EQUAL ZEROS                                00067554
                 MOVE 'ENCONTRADO - SALARIO INCONSISTENTE' TO MSGO      00067655
              ELSE                                                      00067754
                 MOVE 'ENCONTRADO' TO MSGO                              00067854
                 MOVE WRK-SALARIO-ED TO SALARIOO                        00067955
              END-IF                                                    00068054
           END-IF                                                       00068154
           IF WRK-STATUS EQUAL DFHRESP(NOTFND)                          00068254
              MOVE 'NAO EXISTE ' TO MSGO                                00068354
           END-IF.                                                      00068454
                                                                        00069054
      *--------------------------------------------------               00069737
       2100-99-FIM.                                 EXIT.               00069837
      *---------------------------------------------------              00069937
                                                                        00070037
      *--------------------------------------------------               00070137
       2200-INSERIR                              SECTION.               00071037
      *--------------------------------------------------               00080037
      *--------------------------------------------------               00130037
       2200-99-FIM.                                 EXIT.               00140037
      *---------------------------------------------------              00150037
                                                                        00160037
      *--------------------------------------------------               00170037
       2300-DELETAR                              SECTION.               00180041
      *--------------------------------------------------               00190037
      *--------------------------------------------------               00260037
       2300-99-FIM.                                 EXIT.               00270041
      *---------------------------------------------------              00280037
                                                                        00290041
      *--------------------------------------------------               00300041
       2400-VALIDACAO                            SECTION.               00310043
      *--------------------------------------------------               00320041
      *---------------------------------------------------              00391043
       2400-99-FIM.                                 EXIT.               00400043
      *---------------------------------------------------              00410041
                                                                        00420043
      *--------------------------------------------------               00430076
       3000-FINALIZAR                            SECTION.               00440043
      *--------------------------------------------------               00450043
                                                                        00460043
                                                                        00461079
                                                                        00462079
                                                                        00463079
                                                                        00464079
                                                                        00465079
                                                                        00466079
                                                                        00470076
           EXEC CICS                                                    00471076
                RETURN TRANSID('T212')                                  00472076
                COMMAREA(WRK-FASE)                                      00473076
           END-EXEC.                                                    00474076
                                                                        00475076
      *--------------------------------------------------               00520043
       3000-99-FIM.                                 EXIT.               00530043
      *---------------------------------------------------              00540043
