      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR21CB14.                                            00040000
      *=============================================================*   00050000
      *   AUTOR....:VICTOR ARANDA                                   *   00051000
      *   ANALISTA.:IVAN PETRUCCI                  - INSTRUTOR      *   00052000
      *   DATA ....:13/06/2022                                      *   00053000
      *-------------------------------------------------------------*   00054000
      *   OBJETIVO:SOMAR TODOS OS DADOS DADOS PELA SYSIN            *   00055000
      *                                                             *   00056000
      *                                                             *   00057000
      *-------------------------------------------------------------*   00058000
      *   ARQUIVOS:                                                 *   00059000
      *    DDNAME              I/O                  COPY/BOOK       *   00059100
      *                                                             *   00060000
      *                                                             *   00070000
      *=============================================================*   00080000
       ENVIRONMENT                               DIVISION.              00102000
      *====================================================             00103000
       CONFIGURATION                             SECTION .              00104000
                                                                        00104100
       SPECIAL-NAMES.                                                   00104200
           DECIMAL-POINT IS COMMA.                                      00104300
      *====================================================             00105000
       DATA                                      DIVISION.              00106000
      *====================================================             00107000
       WORKING-STORAGE                            SECTION.              00108000
                                                                        00108200
       01 WRK-DADOS.                                                    00108300
          05 WRK-CODIGO     PIC 9(03)     VALUE ZEROS.                  00108400
          05 WRK-ITEM       PIC X(30)     VALUE SPACE.                  00108500
          05 WRK-VALOR      PIC 9(05)V99  VALUE ZEROS.                  00108600
          05 WRK-QUANT      PIC 9(03)     VALUE ZEROS.                  00108700
                                                                        00109000
                                                                        00109100
       77 WRK-ACUM-VALOR     PIC 9(06)V99  VALUE ZEROS.                 00109400
       77 WRK-ACUM-LIDOS     PIC 9(04)     VALUE ZEROS.                 00109800
      *====================RESULTADOS======================             00109900
                                                                        00110000
      *             SEM CALCULOS NECESSARIOS                            00110100
                                                                        00110200
      *====================FORMATACAO=====================              00110300
                                                                        00110400
       77 WRK-ACUM-VALOR-ED  PIC ZZZ.ZZ9,99.                            00110500
                                                                        00110700
      *====================================================             00110800
       PROCEDURE                                 DIVISION.              00110900
      *====================================================             00111000
                                                                        00111100
           PERFORM 1000-INICIO.                                         00111200
                                                                        00111300
           IF WRK-CODIGO NOT EQUAL ZEROS                                00111400
              PERFORM 2000-PROCESSO UNTIL WRK-CODIGO = 999              00111500
           END-IF.                                                      00111600
                                                                        00111700
           PERFORM 2300-SOMATORIA.                                      00111800
           PERFORM 3000-FIM.                                            00111900
                                                                        00112000
      *====================================================             00112100
       1000-INICIO                              SECTION.                00112200
      *====================================================             00112300
                                                                        00112400
                                                                        00112500
      *    RECEBIMENTO DE DADOS                                         00112600
           ACCEPT WRK-DADOS FROM SYSIN.                                 00112700
                                                                        00112800
                                                                        00112900
                                                                        00113000
      *====================================================             00113100
       1000-99-FIM.                                 EXIT.               00113200
      *====================================================             00113300
                                                                        00113400
                                                                        00113500
      *====================================================             00113600
       2000-PROCESSO                            SECTION.                00113700
      *====================================================             00113800
                                                                        00120000
           DISPLAY WRK-DADOS.                                           00120100
           PERFORM 2100-CALCULAR.                                       00120300
                                                                        00120400
      *====================================================             00120500
       2000-99-FIM.                                 EXIT.               00120600
      *====================================================             00120700
                                                                        00120800
      *====================================================             00120900
       2100-CALCULAR                   SECTION.                         00121000
      *====================================================             00121100
                                                                        00121200
           ADD 1 TO WRK-ACUM-LIDOS.                                     00121300
           ADD WRK-VALOR TO WRK-ACUM-VALOR                              00121400
           ACCEPT WRK-DADOS FROM SYSIN.                                 00121500
                                                                        00121600
                                                                        00121700
      *====================================================             00121800
       2100-99-FIM.                                 EXIT.               00121900
      *====================================================             00122000
                                                                        00122100
                                                                        00122600
      *====================================================             00122700
       2200-99-FIM.                                 EXIT.               00122800
      *====================================================             00122900
                                                                        00123000
      *====================================================             00123100
       2300-SOMATORIA                       SECTION.                    00123200
      *====================================================             00123300
           MOVE WRK-ACUM-VALOR TO WRK-ACUM-VALOR-ED.                    00123400
           DISPLAY WRK-ACUM-VALOR-ED.                                   00123600
           DISPLAY WRK-ACUM-LIDOS.                                      00123700
                                                                        00123800
                                                                        00123900
                                                                        00124000
      *====================================================             00124100
       2300-99-FIM.                                 EXIT.               00124200
      *====================================================             00124300
                                                                        00124400
      *====================================================             00124500
       3000-FIM                                   SECTION.              00124600
      *====================================================             00124700
                                                                        00124800
           STOP RUN.                                                    00125000
                                                                        00130000
      *====================================================             00131000
       3000-99-FIM.                                  EXIT.              00132000
      *====================================================             00133000
                                                                        00140000
