      *=============================================================*   00001000
       IDENTIFICATION                            DIVISION.              00002000
      *=============================================================*   00003000
                                                                        00004000
       PROGRAM-ID. FR21DB05.                                            00005006
                                                                        00006000
      *=============================================================*   00007000
      *   AUTOR....:VICTOR ARANDA                                   *   00007106
      *   ANALISTA.:IVAN PETRUCCI                  - INSTRUTOR      *   00007200
      *   DATA ....:09/06/2022                                      *   00007306
      *-------------------------------------------------------------*   00007400
      *   OBJETIVO: UPDATE EM TABELA DB2                            *   00007515
      *                                                             *   00007615
      *                                                             *   00007700
      *                                                             *   00007800
      *-------------------------------------------------------------*   00007900
      *   ARQUIVOS...:                                              *   00008000
      *    DDNAME              I/O                 INCLUDE/BOOK     *   00008100
      *   IVAN.FUNC             I                  #BKFUNC----      *   00008200
      *-------------------------------------------------------------*   00008300
      *   MODULOS....:                             INCLUDE/BOOK     *   00008400
      *=============================================================*   00008500
                                                                        00008600
      *=============================================================*   00008700
       ENVIRONMENT                               DIVISION.              00008800
      *=============================================================*   00008900
                                                                        00009000
      *=============================================================*   00009100
       CONFIGURATION                               SECTION.             00009200
      *=============================================================*   00009300
       SPECIAL-NAMES.                                                   00009400
           DECIMAL-POINT IS COMMA.                                      00009500
                                                                        00009600
      *=============================================================*   00009700
       DATA                                      DIVISION.              00009800
      *=============================================================*   00009900
      *=============================================================*   00010000
       WORKING-STORAGE                             SECTION.             00020000
      *=============================================================*   00021000
                                                                        00021100
           EXEC SQL                                                     00021200
              INCLUDE #BKFUNC                                           00021300
           END-EXEC.                                                    00021400
                                                                        00021500
           EXEC SQL                                                     00021600
              INCLUDE SQLCA                                             00021700
           END-EXEC.                                                    00021800
                                                                        00021900
       77 WRK-SQLCODE         PIC -999.                                 00022000
                                                                        00022113
       77 WRK-NULL-EMAIL PIC S9(04) COMP VALUE ZEROS.                   00023013
                                                                        00023113
       01 WRK-ID.                                                       00024000
          05 FILLER              PIC X(10).                             00024100
          05 WRK-ID-AC           PIC 9(05).                             00024200
                                                                        00024300
       01 WRK-NOME.                                                     00024400
          05 FILLER              PIC X(10).                             00024500
          05 WRK-NOME-AC         PIC X(30).                             00024600
                                                                        00024700
       01 WRK-SETOR.                                                    00024800
          05 FILLER              PIC X(10).                             00024900
          05 WRK-SETOR-AC        PIC X(04).                             00025000
                                                                        00025100
       01 WRK-SALARIO.                                                  00025200
          05 FILLER              PIC X(10).                             00025300
          05 WRK-SALARIO-AC      PIC 9(08)V99.                          00025400
                                                                        00025500
       01 WRK-DATAADM.                                                  00025600
          05 FILLER              PIC X(10).                             00025700
          05 WRK-DATAADM-AC      PIC X(10).                             00025800
                                                                        00025900
       01 WRK-EMAIL.                                                    00026000
          05 FILLER              PIC X(10).                             00026100
          05 WRK-EMAIL-AC        PIC X(40).                             00026200
                                                                        00026300
      *=============================================================*   00026400
       PROCEDURE DIVISION.                                              00026500
      *=============================================================*   00026600
                                                                        00026700
      *-------------------------------------------------------------*   00026800
       0000-PRINCIPAL                           SECTION.                00026900
      *-------------------------------------------------------------*   00027000
                                                                        00027100
            PERFORM  1000-INICIAR.                                      00027200
            PERFORM  1200-TESTA-REGISTROS.                              00027306
            PERFORM  2000-PROCESSAR.                                    00027400
            PERFORM  3000-FINALIZAR.                                    00027500
            STOP RUN.                                                   00027600
                                                                        00027700
      *-------------------------------------------------------------*   00027800
       1000-INICIAR                             SECTION.                00027900
      *-------------------------------------------------------------*   00028000
                                                                        00028100
            ACCEPT WRK-ID.                                              00028200
            ACCEPT WRK-NOME.                                            00028300
            ACCEPT WRK-SETOR.                                           00028400
            ACCEPT WRK-SALARIO.                                         00028500
            ACCEPT WRK-DATAADM.                                         00028600
            ACCEPT WRK-EMAIL.                                           00028700
                                                                        00028800
      *-------------------------------------------------------------*   00028900
       1000-99-FIM.              EXIT.                                  00029000
      *-------------------------------------------------------------*   00029100
                                                                        00029200
      *-------------------------------------------------------------*   00029300
       1200-TESTA-REGISTROS                     SECTION.                00029400
      *-------------------------------------------------------------*   00029500
                                                                        00029600
            IF WRK-ID-AC IS NUMERIC                                     00029709
              CONTINUE                                                  00029800
            ELSE                                                        00029900
             DISPLAY 'ID NAO ENCONTRADO'                                00030006
              PERFORM 3000-FINALIZAR                                    00030100
               STOP RUN                                                 00030200
            END-IF.                                                     00030300
                                                                        00030400
      *-------------------------------------------------------------*   00030500
       1200-99-FIM.              EXIT.                                  00030600
      *-------------------------------------------------------------*   00030700
      *-------------------------------------------------------------*   00030800
       2000-PROCESSAR                           SECTION.                00030900
      *-------------------------------------------------------------*   00031000
                                                                        00032000
            MOVE WRK-ID-AC   TO DB2-ID.                                 00032100
                                                                        00032200
            EXEC SQL                                                    00032300
            SELECT ID,NOME,SETOR,SALARIO,DATAADM,EMAIL                  00032400
             INTO :DB2-ID,                                              00032500
                  :DB2-NOME,                                            00032600
                  :DB2-SETOR,                                           00032700
                  :DB2-SALARIO,                                         00032800
                  :DB2-DATAADM,                                         00032900
                  :DB2-EMAIL      :WRK-NULL-EMAIL                       00033013
             FROM IVAN.FUNC                                             00033100
              WHERE ID= :DB2-ID                                         00033200
            END-EXEC.                                                   00033300
                                                                        00033400
                                                                        00033506
           IF WRK-NOME-AC        NOT EQUAL DB2-NOME AND                 00033606
              WRK-NOME-AC        NOT EQUAL SPACES                       00033706
            MOVE WRK-NOME-AC     TO DB2-NOME                            00033800
                                                                        00033906
           END-IF.                                                      00034000
                                                                        00034106
           IF WRK-SETOR-AC       NOT EQUAL DB2-SETOR AND                00034206
              WRK-SETOR-AC       NOT EQUAL SPACES                       00034306
            MOVE WRK-SETOR-AC    TO DB2-SETOR                           00034400
                                                                        00034506
           END-IF.                                                      00034600
                                                                        00034706
           IF WRK-SALARIO-AC     NOT EQUAL DB2-SALARIO AND              00034806
              WRK-SALARIO-AC     IS NUMERIC                             00034910
            MOVE WRK-SALARIO-AC  TO DB2-SALARIO                         00035000
                                                                        00035106
           END-IF.                                                      00035200
                                                                        00035306
           IF WRK-DATAADM-AC     NOT EQUAL DB2-NOME AND                 00035406
              WRK-DATAADM-AC     NOT EQUAL SPACES                       00035506
            MOVE WRK-DATAADM-AC  TO DB2-DATAADM                         00035600
                                                                        00035706
           END-IF.                                                      00035800
                                                                        00035906
           IF WRK-EMAIL-AC       NOT EQUAL DB2-EMAIL AND                00036011
              WRK-EMAIL-AC       NOT EQUAL SPACES                       00036113
            MOVE WRK-EMAIL-AC    TO DB2-EMAIL                           00036411
           END-IF.                                                      00036700
                                                                        00037000
           IF WRK-NULL-EMAIL     NOT EQUAL 0 AND                        00037113
              WRK-EMAIL-AC       NOT EQUAL SPACES                       00037213
            MOVE WRK-EMAIL-AC    TO DB2-EMAIL                           00037313
           END-IF.                                                      00037413
                                                                        00037500
            EVALUATE SQLCODE                                            00037600
             WHEN 0                                                     00037700
              PERFORM 2100-UPDATE                                       00037800
              DISPLAY 'DADOS ATUALIZADOS'                               00037900
              DISPLAY 'ID..... ' DB2-ID                                 00038000
              DISPLAY 'NOME... ' DB2-NOME                               00038100
              DISPLAY 'SETOR.. ' DB2-SETOR                              00038200
              DISPLAY 'SALARIO ' DB2-SALARIO                            00038300
              DISPLAY 'DATAADM ' DB2-DATAADM                            00038406
              DISPLAY 'EMAIL   ' DB2-EMAIL                              00038506
             WHEN -181                                                  00038606
              DISPLAY 'DATA INSERIDA EM FORMATO ERRADO ' DB2-ID         00038706
             WHEN OTHER                                                 00038806
               MOVE SQLCODE TO WRK-SQLCODE                              00039506
               DISPLAY 'ERRO NA LEITURA ' WRK-SQLCODE                   00039606
            END-EVALUATE.                                               00039706
                                                                        00039806
      *-------------------------------------------------------------*   00039906
       2000-99-FIM.              EXIT.                                  00040006
      *-------------------------------------------------------------*   00040106
      *-------------------------------------------------------------*   00040206
       2100-UPDATE                              SECTION.                00040306
      *-------------------------------------------------------------*   00040406
            IF DB2-EMAIL EQUAL 'NULL'                                   00040511
                                                                        00040614
            EXEC SQL                                                    00040706
             UPDATE IVAN.FUNC SET NOME    = :DB2-NOME,                  00040806
                                  SETOR   = :DB2-SETOR,                 00040906
                                  SALARIO = :DB2-SALARIO,               00041006
                                  DATAADM = :DB2-DATAADM,               00041106
                                  EMAIL   = NULL                        00041210
                          WHERE ID= :DB2-ID                             00041306
            END-EXEC                                                    00041406
                                                                        00041506
            ELSE                                                        00041606
            EXEC SQL                                                    00041706
             UPDATE IVAN.FUNC SET NOME    = :DB2-NOME,                  00041806
                                  SETOR   = :DB2-SETOR,                 00041906
                                  SALARIO = :DB2-SALARIO,               00042006
                                  DATAADM = :DB2-DATAADM,               00042106
                                  EMAIL   = :DB2-EMAIL                  00042210
                          WHERE ID= :DB2-ID                             00042306
            END-EXEC                                                    00042406
                                                                        00042506
            END-IF.                                                     00042606
      *-------------------------------------------------------------*   00042706
       2100-99-FIM.              EXIT.                                  00042806
      *-------------------------------------------------------------*   00042906
                                                                        00043006
      *-------------------------------------------------------------*   00043106
       3000-FINALIZAR                           SECTION.                00043206
      *-------------------------------------------------------------*   00043306
                                                                        00043406
              DISPLAY ' -----FIM DO PROGRAMA----- '.                    00043506
                                                                        00043606
      *-------------------------------------------------------------*   00043706
       3000-99-FIM.              EXIT.                                  00043806
      *-------------------------------------------------------------*   00043906
      *-------------------------------------------------------------*   00044006
       9000-TRATAERROS                              SECTION.            00044106
      *-------------------------------------------------------------*   00044206
                                                                        00044306
      *-------------------------------------------------------------*   00044406
       9000-99-FIM.              EXIT.                                  00045000
      *-------------------------------------------------------------*   00050000
