      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR21CB10.                                            00040000
      *=============================================================*   00050000
      *   AUTOR....:VICTOR ARANDA                                   *   00051000
      *   ANALISTA.:IVAN PETRUCCI                  - INSTRUTOR      *   00052000
      *   DATA ....:09/06/2022                                      *   00053001
      *-------------------------------------------------------------*   00054000
      *   OBJETIVO:EVALUATE (LOJA DE PRODUTOS COM FRETE )           *   00055001
      *                                                             *   00056000
      *                                                             *   00057000
      *-------------------------------------------------------------*   00058000
      *   ARQUIVOS:                                                 *   00059000
      *    DDNAME              I/O                  COPY/BOOK       *   00059100
      *                                                             *   00059200
      *                                                             *   00059300
      *=============================================================*   00059400
       ENVIRONMENT                               DIVISION.              00102000
      *====================================================             00103000
       CONFIGURATION                             SECTION .              00104000
                                                                        00104100
       SPECIAL-NAMES.                                                   00104200
           DECIMAL-POINT IS COMMA.                                      00104300
      *====================================================             00105000
       DATA                                      DIVISION.              00106000
      *====================================================             00107000
       WORKING-STORAGE                            SECTION.              00108000
                                                                        00108200
       01 WRK-DADOS.                                                    00108300
          05 WRK-COD        PIC 9(05)    VALUE ZEROS.                   00108400
          05 WRK-PROD       PIC X(30)    VALUE SPACES.                  00108500
          05 WRK-VALOR      PIC 9(06)V99 VALUE ZEROS.                   00108600
          05 WRK-ESTADO     PIC X(02)    VALUE SPACES.                  00108700
                                                                        00108900
      *====================RESULTADOS======================             00109000
                                                                        00109100
                                                                        00109200
       77 WRK-FRETE         PIC 9(06)V99 VALUE ZEROS.                   00109300
                                                                        00109500
                                                                        00109800
      *====================FORMATACAO=====================              00109900
                                                                        00110000
       77 WRK-VALOR-EDT     PIC ZZZ.ZZ9,99.                             00110100
                                                                        00110200
       77 WRK-FRETE-EDT     PIC ZZZ.ZZ9,99.                             00110300
                                                                        00110400
                                                                        00110600
      *====================================================             00110700
       PROCEDURE                                 DIVISION.              00110800
      *====================================================             00110900
                                                                        00111000
           PERFORM 1000-INICIO.                                         00111100
           PERFORM 2000-PROCESSO.                                       00111200
           PERFORM 3000-FIM.                                            00111300
                                                                        00111400
      *====================================================             00111500
       1000-INICIO                              SECTION.                00111600
      *====================================================             00111700
                                                                        00111800
                                                                        00111900
      *    RECEBIMENTO DE DADOS                                         00112000
           ACCEPT WRK-DADOS FROM SYSIN.                                 00112100
                                                                        00112200
                                                                        00112300
                                                                        00112400
      *====================================================             00112500
       1000-99-FIM.                                 EXIT.               00112600
      *====================================================             00112700
                                                                        00112800
                                                                        00112900
      *====================================================             00113000
       2000-PROCESSO                            SECTION.                00113100
      *====================================================             00113200
                                                                        00113300
                                                                        00115500
           IF WRK-VALOR > 1000                                          00115600
                                                                        00115700
                                                                        00115800
             EVALUATE WRK-ESTADO                                        00116500
                                                                        00116600
                 WHEN 'SP'                                              00116700
                    COMPUTE WRK-FRETE = WRK-VALOR * 0,10                00116800
                    MOVE WRK-FRETE TO WRK-FRETE-EDT                     00116900
                    DISPLAY WRK-FRETE-EDT                               00117000
                    PERFORM 2100-DISPLAY                                00117100
                                                                        00117200
                 WHEN 'RJ'                                              00117300
                    COMPUTE WRK-FRETE = WRK-VALOR  * 0,15               00117400
                    MOVE WRK-FRETE TO WRK-FRETE-EDT                     00117500
                    DISPLAY WRK-FRETE-EDT                               00117600
                    PERFORM 2100-DISPLAY                                00117700
                                                                        00117800
                 WHEN 'MG'                                              00117900
                    COMPUTE WRK-FRETE = WRK-VALOR  * 0,20               00118000
                    MOVE WRK-FRETE TO WRK-FRETE-EDT                     00118100
                    DISPLAY WRK-FRETE-EDT                               00118200
                    PERFORM 2100-DISPLAY                                00118300
                                                                        00118400
                 WHEN OTHER                                             00118500
                    DISPLAY 'NAO FAZEMOS ENTREGAS NESSA REGIAO'         00118600
                                                                        00118700
             END-EVALUATE                                               00118800
                                                                        00118900
           ELSE                                                         00119000
              DISPLAY 'FACA A RETIDARA DO PRODUTO NA LOJA'              00119100
           END-IF.                                                      00119200
                                                                        00119300
                                                                        00119400
                                                                        00119500
      *====================================================             00119600
       2000-99-FIM.                                 EXIT.               00119700
      *====================================================             00119800
                                                                        00119900
      *====================================================             00120000
       2100-DISPLAY                            SECTION.                 00120100
      *====================================================             00120200
                                                                        00120300
             DISPLAY 'CODIGO ....' WRK-COD.                             00120400
             DISPLAY 'PRODUTO....' WRK-PROD.                            00120500
             MOVE WRK-VALOR  TO    WRK-VALOR-EDT.                       00120600
             DISPLAY 'VALOR  ....' WRK-VALOR-EDT.                       00120700
                                                                        00120800
      *====================================================             00120900
       2100-99-FIM.                                  EXIT.              00121000
      *====================================================             00121100
                                                                        00121200
      *====================================================             00121300
       3000-FIM                                   SECTION.              00121400
      *====================================================             00121500
                                                                        00121600
           STOP RUN.                                                    00122000
                                                                        00130000
      *====================================================             00131000
       3000-99-FIM.                                  EXIT.              00132000
      *====================================================             00133000
                                                                        00140000
