      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR21CB06.                                            00040000
      *=============================================================*   00050000
      *   AUTOR....:VICTOR ARANDA                                   *   00051000
      *   ANALISTA.:IVAN PETRUCCI                  - INSTRUTOR      *   00052000
      *   DATA ....:04/06/2022                                      *   00053000
      *-------------------------------------------------------------*   00054000
      *   OBJETIVO:CALCULOS, SOMA                                   *   00055000
      *                                                             *   00056000
      *                                                             *   00057000
      *-------------------------------------------------------------*   00058000
      *   ARQUIVOS:                                                 *   00060000
      *    DDNAME              I/O                  COPY/BOOK       *   00070000
      *                                                             *   00080000
      *                                                             *   00090000
      *=============================================================*   00100000
       ENVIRONMENT                               DIVISION.              00102000
      *====================================================             00103000
                                                                        00104000
      *====================================================             00105000
       DATA                                      DIVISION.              00106000
      *====================================================             00107000
       WORKING-STORAGE                         SECTION.                 00108000
       01 WRK-DADOS.                                                    00108100
          05 WRK-N1         PIC 9(02) VALUE ZEROS.                      00108200
          05 WRK-N2         PIC 9(02) VALUE ZEROS.                      00108300
          05 WRK-N3         PIC 9(02) VALUE ZEROS.                      00108400
       77 WRK-N4            PIC 9(02) VALUE 10.                         00108500
      *====================================================             00110200
       PROCEDURE                                 DIVISION.              00110300
      *====================================================             00110400
           ACCEPT WRK-DADOS FROM SYSIN.                                 00110500
           DISPLAY 'WRK-N1        ..  '   WRK-N1.                       00110700
           DISPLAY 'WRK-N2        ..  '   WRK-N2.                       00110800
           DISPLAY 'WRK-N3        ..  '   WRK-N3.                       00110900
           ADD WRK-N1  WRK-N2  WRK-N3 TO  WRK-N4.                       00111000
           DISPLAY 'RESULTADO     ..  '   WRK-N4.                       00111100
           STOP RUN.                                                    00112000
