      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR21CB03.                                            00040000
      *=============================================================*   00050000
      *   AUTOR....:VICTOR ARANDA                                   *   00051000
      *   ANALISTA.:IVAN PETRUCCI                  - INSTRUTOR      *   00052000
      *   DATA ....:01/06/2022                                      *   00053001
      *-------------------------------------------------------------*   00054000
      *   OBJETIVO:ACCEPT DE DADOS EM UMA VARIAVEL                  *   00055000
      *                                                             *   00056000
      *                                                             *   00057000
      *-------------------------------------------------------------*   00058000
      *   ARQUIVOS:                                                 *   00060000
      *    DDNAME              I/O                  COPY/BOOK       *   00070000
      *                                                             *   00080000
      *                                                             *   00090000
      *=============================================================*   00100000
      *====================================================             00101000
       ENVIRONMENT                               DIVISION.              00102000
      *====================================================             00103000
                                                                        00104000
      *====================================================             00105000
       DATA                                      DIVISION.              00106000
      *====================================================             00107000
       WORKING-STORAGE                           SECTION.               00108000
       01 WRK-DADOS.                                                    00109000
          05 WRK-CODIGO PIC X(07) VALUE SPACES.                         00110000
          05 WRK-NOME   PIC X(23) VALUE SPACES.                         00120000
          05 WRK-ESTADO PIC X(02) VALUE SPACES.                         00130000
          05 WRK-CURSO  PIC X(10) VALUE SPACES.                         00130100
          05 WRK-SAL    PIC 9(05) VALUE ZEROS.                          00130200
      *====================================================             00131000
       PROCEDURE                                 DIVISION.              00140000
      *====================================================             00150000
           ACCEPT WRK-DADOS FROM SYSIN.                                 00160000
           DISPLAY 'CODIGO..... ' WRK-CODIGO.                           00180000
           DISPLAY 'NOME....... ' WRK-NOME.                             00180100
           DISPLAY 'ESTADO..... ' WRK-ESTADO.                           00180200
           DISPLAY 'CURSO...... ' WRK-CURSO.                            00180300
           DISPLAY 'SALARIO.... ' WRK-SAL.                              00180400
           STOP RUN.                                                    00182000
                                                                        00183000
                                                                        00184000
