      *=============================================================*   00001000
       IDENTIFICATION                            DIVISION.              00002000
      *=============================================================*   00003000
                                                                        00004000
       PROGRAM-ID. FR21DB04.                                            00005037
                                                                        00006000
      *=============================================================*   00007000
      *   AUTOR....:VICTOR ARANDA                                   *   00007124
      *   ANALISTA.:IVAN PETRUCCI                  - INSTRUTOR      *   00007200
      *   DATA ....:30/05/2022                                      *   00007300
      *-------------------------------------------------------------*   00007400
      *   OBJETIVO: DELETE DE TABELA DB2                           *    00007539
      *                                                             *   00007824
      *-------------------------------------------------------------*   00007900
      *   ARQUIVOS...:                                              *   00008000
      *    DDNAME              I/O                 INCLUDE/BOOK     *   00008100
      *   IVAN.FUNC             I                  #BKFUNC----      *   00008216
      *-------------------------------------------------------------*   00008300
      *   MODULOS....:                             INCLUDE/BOOK     *   00008400
      *=============================================================*   00008500
                                                                        00008600
      *=============================================================*   00008700
       ENVIRONMENT                               DIVISION.              00008800
      *=============================================================*   00008900
                                                                        00009000
      *=============================================================*   00009100
       CONFIGURATION                               SECTION.             00009200
      *=============================================================*   00009300
       SPECIAL-NAMES.                                                   00009400
           DECIMAL-POINT IS COMMA.                                      00009500
                                                                        00009600
      *=============================================================*   00009700
       DATA                                      DIVISION.              00009800
      *=============================================================*   00009900
      *=============================================================*   00010000
       WORKING-STORAGE                             SECTION.             00011000
      *=============================================================*   00020000
                                                                        00021000
           EXEC SQL                                                     00022000
              INCLUDE #BKFUNC                                           00023000
           END-EXEC.                                                    00023100
                                                                        00023200
           EXEC SQL                                                     00023300
              INCLUDE SQLCA                                             00023400
           END-EXEC.                                                    00023500
                                                                        00023724
                                                                        00024324
                                                                        00024424
      *-------------------------------------------------------------*   00024524
       77 WRK-SQLCODE PIC -999.                                         00024631
                                                                        00024831
       01 WRK-ID.                                                       00024931
          02 FILLER           PIC X(10).                                00025031
          02 WRK-ID-AC        PIC 9(04).                                00025131
                                                                        00027718
      *=============================================================*   00027818
       PROCEDURE DIVISION.                                              00027900
      *=============================================================*   00028000
                                                                        00028100
      *-------------------------------------------------------------*   00028200
       0000-PRINCIPAL                           SECTION.                00028300
      *-------------------------------------------------------------*   00028400
                                                                        00028500
            PERFORM  1000-INICIAR.                                      00028600
            PERFORM  2000-PROCESSAR.                                    00028731
            PERFORM  3000-FINALIZAR.                                    00028800
                                                                        00028931
                                                                        00029000
      *-------------------------------------------------------------*   00029100
       1000-INICIAR                             SECTION.                00029200
      *-------------------------------------------------------------*   00029300
                                                                        00029724
           ACCEPT WRK-ID FROM SYSIN.                                    00029837
       1000-99-FIM.              EXIT.                                  00031531
      *-------------------------------------------------------------*   00031631
       2000-PROCESSAR                           SECTION.                00031731
      *-------------------------------------------------------------*   00031831
           MOVE WRK-ID-AC TO  DB2-ID.                                   00032038
                                                                        00034237
           EXEC SQL                                                     00034337
             DELETE FROM IVAN.FUNC WHERE ID = :DB2-ID                   00034437
           END-EXEC.                                                    00034537
                                                                        00034637
           EVALUATE SQLCODE                                             00034837
            WHEN 0                                                      00034937
             DISPLAY 'REGISTRO DELETADO.' WRK-ID-AC                     00035038
            WHEN 100                                                    00036037
             DISPLAY 'NAO ENCONTRADO ' DB2-ID                           00036137
            WHEN OTHER                                                  00036237
             MOVE SQLCODE TO WRK-SQLCODE                                00036337
              DISPLAY 'ERRO NA LEITURA ' WRK-SQLCODE                    00036437
            END-EVALUATE.                                               00036537
                                                                        00036637
                                                                        00036737
                                                                        00036833
       2000-99-FIM.              EXIT.                                  00036902
      *-------------------------------------------------------------*   00037025
      *-------------------------------------------------------------*   00039600
       3000-FINALIZAR                               SECTION.            00039700
      *-------------------------------------------------------------*   00039800
              DISPLAY 'FIM DO PROGRAMA'.                                00042233
              STOP RUN.                                                 00042333
                                                                        00042433
       3000-99-FIM.              EXIT.                                  00042533
      *-------------------------------------------------------------*   00043019
      *-------------------------------------------------------------*   00043919
       9000-TRATAERROS                              SECTION.            00044019
                                                                        00044131
                                                                        00045000
       9000-99-FIM.              EXIT.                                  00050000
