      *=============================================================*   00001000
       IDENTIFICATION                            DIVISION.              00002000
      *=============================================================*   00003000
                                                                        00004000
       PROGRAM-ID. FR21DB02.                                            00005024
                                                                        00006000
      *=============================================================*   00007000
      *   AUTOR....:VICTOR ARANDA                                   *   00007124
      *   ANALISTA.:IVAN PETRUCCI                  - INSTRUTOR      *   00007200
      *   DATA ....:30/05/2022                                      *   00007300
      *-------------------------------------------------------------*   00007400
      *   OBJETIVO: LER TODOS OS DADOS DE TABELA DB2 COM CURSOR     *   00007531
      *                                                             *   00007824
      *-------------------------------------------------------------*   00007900
      *   ARQUIVOS...:                                              *   00008000
      *    DDNAME              I/O                 INCLUDE/BOOK     *   00008100
      *   IVAN.FUNC             I                  #BKFUNC----      *   00008216
      *-------------------------------------------------------------*   00008300
      *   MODULOS....:                             INCLUDE/BOOK     *   00008400
      *=============================================================*   00008500
                                                                        00008600
      *=============================================================*   00008700
       ENVIRONMENT                               DIVISION.              00008800
      *=============================================================*   00008900
                                                                        00009000
      *=============================================================*   00009100
       CONFIGURATION                               SECTION.             00009200
      *=============================================================*   00009300
       SPECIAL-NAMES.                                                   00009400
           DECIMAL-POINT IS COMMA.                                      00009500
                                                                        00009600
      *=============================================================*   00009700
       DATA                                      DIVISION.              00009800
      *=============================================================*   00009900
      *=============================================================*   00010000
       WORKING-STORAGE                             SECTION.             00011000
      *=============================================================*   00020000
                                                                        00021000
           EXEC SQL                                                     00022000
              INCLUDE #BKFUNC                                           00023000
           END-EXEC.                                                    00023100
                                                                        00023200
           EXEC SQL                                                     00023300
              INCLUDE SQLCA                                             00023400
           END-EXEC.                                                    00023500
                                                                        00023724
           EXEC SQL                                                     00023800
              DECLARE CFUNC CURSOR FOR                                  00023900
               SELECT * FROM IVAN.FUNC                                  00024001
                ORDER BY ID                                             00024118
           END-EXEC.                                                    00024200
                                                                        00024324
                                                                        00024424
      *-------------------------------------------------------------*   00024524
       77 WRK-REGLIDOS        PIC 9(03).                                00024605
                                                                        00024724
       77 WRK-MAIOR-VALOR     PIC S9(8)V9(2) COMP.                      00024819
                                                                        00024925
       77 WRK-MEDIA           PIC S9(8)V9(2) COMP.                      00025025
                                                                        00025125
       77 WRK-SAL-ACUM        PIC S9(8)V9(2) COMP.                      00025225
                                                                        00025324
       77 WRK-SQLCODE         PIC -999.                                 00025618
                                                                        00025724
       77 WRK-NULL-EMAIL      PIC S9(4) COMP.                           00025827
                                                                        00025918
      *=============================================================*   00026018
       PROCEDURE DIVISION.                                              00026100
      *=============================================================*   00026200
                                                                        00026300
      *-------------------------------------------------------------*   00026400
       0000-PRINCIPAL                           SECTION.                00026500
      *-------------------------------------------------------------*   00026600
                                                                        00026700
            PERFORM  1000-INICIAR.                                      00026800
            PERFORM  2000-PROCESSAR UNTIL SQLCODE NOT EQUAL ZERO.       00026925
            PERFORM  3000-FINALIZAR.                                    00027000
            STOP RUN.                                                   00027100
                                                                        00027300
      *-------------------------------------------------------------*   00027400
       1000-INICIAR                             SECTION.                00027500
      *-------------------------------------------------------------*   00027600
            EXEC SQL                                                    00027700
               OPEN CFUNC                                               00027800
            END-EXEC.                                                   00027900
                                                                        00028024
             EVALUATE SQLCODE                                           00028100
                WHEN 0                                                  00028225
                  PERFORM 2500-LEITURA-DB2                              00028425
                WHEN 100                                                00028525
                  DISPLAY 'SEM FUNCIONARIO'                             00028625
                WHEN OTHER                                              00028725
                  MOVE SQLCODE TO WRK-SQLCODE                           00028825
                  DISPLAY 'ERRO ' WRK-SQLCODE ' NO OPEN DO CURSOR.'     00028925
                  MOVE 200 TO RETURN-CODE                               00029025
                  STOP RUN                                              00029125
             END-EVALUATE.                                              00029200
                                                                        00029300
       1000-99-FIM.              EXIT.                                  00029400
      *-------------------------------------------------------------*   00029500
       2000-PROCESSAR                           SECTION.                00029600
      *-------------------------------------------------------------*   00030000
                                                                        00031000
              DISPLAY '----------------'                                00034230
              DISPLAY 'ID..... ' DB2-ID                                 00034330
              DISPLAY 'NOME... ' DB2-NOME                               00034430
              DISPLAY 'SETOR.. ' DB2-SETOR                              00034530
              DISPLAY 'SALARIO ' DB2-SALARIO                            00034630
              DISPLAY 'DATAADM ' DB2-DATAADM                            00034830
                                                                        00035030
             IF WRK-NULL-EMAIL = 0                                      00035130
               DISPLAY 'EMAIL. ' DB2-EMAIL                              00035230
                                                                        00035330
             ELSE                                                       00035430
               DISPLAY 'SEM EMAIL REGISTRADO '                          00035530
             END-IF.                                                    00035630
                                                                        00035826
              DISPLAY '----------------'.                               00035930
              PERFORM 2500-LEITURA-DB2.                                 00036025
                                                                        00036103
       2000-99-FIM.              EXIT.                                  00036202
      *-------------------------------------------------------------*   00037025
       2500-LEITURA-DB2                             SECTION.            00037125
      *-------------------------------------------------------------*   00037225
                                                                        00037325
           EXEC SQL                                                     00037425
            FETCH CFUNC                                                 00037525
             INTO :DB2-ID,                                              00037625
                  :DB2-NOME,                                            00037725
                  :DB2-SETOR,                                           00037825
                  :DB2-SALARIO,                                         00037925
                  :DB2-DATAADM,                                         00038025
                  :DB2-EMAIL     :WRK-NULL-EMAIL                        00038125
            END-EXEC.                                                   00038225
                                                                        00038325
            EVALUATE SQLCODE                                            00038425
             WHEN 0                                                     00038525
               ADD 1 TO WRK-REGLIDOS                                    00038625
                ADD DB2-SALARIO TO WRK-SAL-ACUM                         00038725
             WHEN 100                                                   00038825
              DISPLAY ' FINAL DE ARQUIVO'                               00038925
             WHEN OTHER                                                 00039025
               MOVE SQLCODE TO WRK-SQLCODE                              00039125
               DISPLAY 'ERRO NA LEITURA ' WRK-SQLCODE                   00039225
             END-EVALUATE.                                              00039325
                                                                        00039425
       2500-99-FIM.              EXIT.                                  00039525
      *-------------------------------------------------------------*   00039600
       3000-FINALIZAR                               SECTION.            00039700
      *-------------------------------------------------------------*   00039800
      *-------------------------------------------------------------*   00039924
                                                                        00040029
                                                                        00040129
                                                                        00040229
                                                                        00040325
                                                                        00040429
                                                                        00040525
              EXEC SQL                                                  00040600
                CLOSE CFUNC                                             00040700
              END-EXEC.                                                 00040800
                                                                        00040925
                                                                        00041025
              DISPLAY 'FIM DO PROGRAMA'.                                00041125
              DISPLAY 'REGISTROS LIDOS.......' WRK-REGLIDOS.            00041225
              DISPLAY 'SALARIO ACUMULADO.....' WRK-SAL-ACUM.            00041425
              DIVIDE WRK-SAL-ACUM BY WRK-REGLIDOS                       00041525
                                  GIVING WRK-MEDIA.                     00041625
              DISPLAY 'MEDIA DOS SALARIOS....' WRK-MEDIA.               00041725
                                                                        00041819
       3000-99-FIM.              EXIT.                                  00041919
      *-------------------------------------------------------------*   00042019
      *-------------------------------------------------------------*   00043919
       9000-TRATAERROS                              SECTION.            00044019
      *-------------------------------------------------------------*   00044119
                                                                        00045000
       9000-99-FIM.              EXIT.                                  00050000
