      *===================================================              00010000
       IDENTIFICATION                            DIVISION.              00020000
      *===================================================              00030000
                                                                        00031000
       PROGRAM-ID. FR21DB01.                                            00032001
      *=============================================================*   00033008
      *   AUTOR....:VICTOR ARANDA                                   *   00033108
      *   ANALISTA.:IVAN PETRUCCI                  - INSTRUTOR      *   00033208
      *   DATA ....:16/06/2022                                      *   00033308
      *-------------------------------------------------------------*   00033408
      *   OBJETIVO:LER TABELA DB2                                   *   00033508
      *                                                             *   00033608
      *                                                             *   00033708
      *-------------------------------------------------------------*   00033808
      *   ARQUIVOS:                                                 *   00033908
      *    DDNAME              I/O                  COPY/BOOK       *   00034008
      *                                                             *   00035008
      *                                                             *   00040208
      *=============================================================*   00040308
       ENVIRONMENT                               DIVISION.              00040600
      *===================================================              00040700
       CONFIGURATION                              SECTION.              00040800
       SPECIAL-NAMES.                                                   00040900
           DECIMAL-POINT  IS COMMA.                                     00041000
                                                                        00042000
      *===================================================              00043000
       DATA                                      DIVISION.              00044000
      *==================================================               00044100
       WORKING-STORAGE                            SECTION.              00044200
                                                                        00044300
           EXEC SQL                                                     00044400
              INCLUDE #BKFUNC                                           00044500
           END-EXEC.                                                    00044600
                                                                        00044700
           EXEC SQL                                                     00044800
              INCLUDE SQLCA                                             00044900
           END-EXEC.                                                    00045000
                                                                        00045100
       77 WRK-ID                        PIC 9(05) VALUE ZEROS.          00045200
       77 WRK-SQLCODE                   PIC -999.                       00045300
       77 WRK-NULL-EMAIL                PIC S9(4) COMP.                 00045400
                                                                        00045500
      *===================================================              00045600
       PROCEDURE                                 DIVISION.              00045700
      *===================================================              00045800
      *---------------------------------------------------              00045900
       0000-PRINCIPAL                              SECTION.             00046000
      *---------------------------------------------------              00046100
            PERFORM 1000-INICIALIZAR.                                   00046200
             PERFORM 2000-PROCESSAR.                                    00046307
                                                                        00046407
              PERFORM 3000-FINALIZAR.                                   00046500
               GOBACK.                                                  00046600
      *---------------------------------------------------              00046700
       0000-99-FIM.                                EXIT.                00046800
      *----------------------------------------------------             00046900
       1000-INICIALIZAR                          SECTION.               00047000
      *----------------------------------------------------             00048000
           ACCEPT WRK-ID FROM SYSIN.                                    00049007
      *---------------------------------------------------              00050300
       1000-99-FIM.                                EXIT.                00050400
      *----------------------------------------------------             00050500
      *-----------------------------------------------------            00050600
       2000-PROCESSAR                            SECTION.               00050700
      *-----------------------------------------------------            00050800
              MOVE WRK-ID TO DB2-ID.                                    00050900
                                                                        00051003
             DISPLAY '----------------------------'.                    00051103
                                                                        00051500
            EXEC SQL                                                    00051600
            SELECT ID,NOME,SETOR,SALARIO,DATAADM,EMAIL                  00052000
              INTO :DB2-ID,                                             00053000
                   :DB2-NOME,                                           00055000
                   :DB2-SETOR,                                          00055100
                   :DB2-SALARIO,                                        00055200
                   :DB2-DATAADM,                                        00055300
                   :DB2-EMAIL      :WRK-NULL-EMAIL                      00055400
               FROM  IVAN.FUNC                                          00055500
              WHERE ID = :DB2-ID                                        00055600
            END-EXEC.                                                   00055700
                                                                        00055800
                                                                        00055906
                                                                        00056006
           IF (SQLCODE NOT EQUAL ZEROS AND 100) OR                      00056106
              (SQLWARN0 EQUAL 'W')                                      00056206
                                                                        00056306
              MOVE SQLCODE TO WRK-SQLCODE                               00056407
              DISPLAY 'ERRO NA LEITURA ' WRK-SQLCODE                    00056506
           END-IF.                                                      00056606
                                                                        00056706
           IF (SQLCODE EQUAL 100)                                       00056806
               DISPLAY 'NAO ENCONTRADO ' DB2-ID                         00056906
               STOP RUN                                                 00057006
           END-IF.                                                      00057106
                                                                        00057206
           IF (SQLCODE EQUAL 0)                                         00057306
                                                                        00057406
              DISPLAY 'ID.... ' DB2-ID                                  00057506
              DISPLAY 'NOME.. ' DB2-NOME                                00057606
              DISPLAY 'SETOR. ' DB2-SETOR                               00057706
              DISPLAY 'SALARIO' DB2-SALARIO                             00057806
              DISPLAY 'DATA   ' DB2-DATAADM                             00057906
              IF WRK-NULL-EMAIL = 0                                     00058006
                 DISPLAY 'EMAIL. ' DB2-EMAIL                            00058106
              ELSE                                                      00058206
                 DISPLAY 'EMAIL NULO'                                   00058306
           END-IF.                                                      00058406
                                                                        00058505
           DISPLAY '----------------------------'.                      00058606
                                                                        00058705
                                                                        00058806
                                                                        00058906
                                                                        00059005
                                                                        00059106
                                                                        00059206
                                                                        00059306
                                                                        00059406
                                                                        00059505
                                                                        00059605
      *---------------------------------------------------              00059705
       2000-99-FIM.                                EXIT.                00059805
      *----------------------------------------------------             00059905
      *--------------------------------------------------               00060000
       3000-FINALIZAR                            SECTION.               00060100
      *--------------------------------------------------               00061000
             DISPLAY '------FIM DO PROGRAMA-----'.                      00062000
      *--------------------------------------------------               00062100
       3000-99-FIM.                                 EXIT.               00062200
      *---------------------------------------------------              00062300
       9000-TRATA-ERROS                           SECTION.              00062400
      *---------------------------------------------------              00062500
      *---------------------------------------------------              00062600
       9000-99-FIM.                                  EXIT.              00062700
      *===================================================              00062800
