      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR21CB09.                                            00040000
      *=============================================================*   00050000
      *   AUTOR....:VICTOR ARANDA                                   *   00051000
      *   ANALISTA.:IVAN PETRUCCI                  - INSTRUTOR      *   00052000
      *   DATA ....:08/06/2022                                      *   00053000
      *-------------------------------------------------------------*   00054000
      *   OBJETIVO:TREINO DE CALCULO (COMPUTE)                      *   00055000
      *                                                             *   00056000
      *                                                             *   00057000
      *-------------------------------------------------------------*   00058000
      *   ARQUIVOS:                                                 *   00059000
      *    DDNAME              I/O                  COPY/BOOK       *   00059100
      *                                                             *   00060000
      *                                                             *   00070000
      *=============================================================*   00080000
       ENVIRONMENT                               DIVISION.              00102000
      *====================================================             00103000
       CONFIGURATION                             SECTION .              00104000
                                                                        00104100
       SPECIAL-NAMES.                                                   00104200
           DECIMAL-POINT IS COMMA.                                      00104300
      *====================================================             00105000
       DATA                                      DIVISION.              00106000
      *====================================================             00107000
       WORKING-STORAGE                            SECTION.              00108000
                                                                        00108200
       01 WRK-DADOS.                                                    00108300
          05 WRK-COD        PIC 9(03)    VALUE ZEROS.                   00108400
          05 WRK-PROD       PIC X(30)    VALUE SPACES.                  00108500
          05 WRK-QTVEN      PIC 9(03)    VALUE ZEROS.                   00108600
          05 WRK-VALUNI     PIC 9(05)V99 VALUE ZEROS.                   00108700
                                                                        00108800
      *====================RESULTADOS======================             00108900
                                                                        00109000
                                                                        00109200
       77 WRK-LUCRO         PIC 9(08)V99 VALUE ZEROS.                   00109300
                                                                        00109500
       77 WRK-MEDIA         PIC 9(08)V99 VALUE ZEROS.                   00109600
                                                                        00109800
      *====================FORMATACAO=====================              00109900
                                                                        00110000
       77 WRK-VALUNI-EDT    PIC ZZ.ZZZ.ZZ9,99.                          00110100
                                                                        00110200
       77 WRK-LUCRO-EDT     PIC ZZ.ZZZ.ZZ9,99.                          00110300
                                                                        00110400
       77 WRK-MEDIA-EDT     PIC ZZ.ZZZ.ZZ9,99.                          00110500
                                                                        00110600
      *====================================================             00110700
       PROCEDURE                                 DIVISION.              00110800
      *====================================================             00110900
                                                                        00111000
           PERFORM 1000-INICIO.                                         00111100
           PERFORM 2000-PROCESSO.                                       00111200
           PERFORM 3000-FIM.                                            00111300
                                                                        00111400
      *====================================================             00111500
       1000-INICIO                              SECTION.                00111600
      *====================================================             00111700
                                                                        00111800
                                                                        00111900
      *    RECEBIMENTO DE DADOS                                         00112000
           ACCEPT WRK-DADOS FROM SYSIN.                                 00112100
                                                                        00112200
                                                                        00112300
                                                                        00112400
      *====================================================             00112500
       1000-99-FIM.                                 EXIT.               00112600
      *====================================================             00112700
                                                                        00112800
                                                                        00112900
      *====================================================             00113000
       2000-PROCESSO                            SECTION.                00113100
      *====================================================             00113200
                                                                        00113300
      *    DISPLAY DE VARIAVEIS                                         00113400
           DISPLAY 'CODIGO ....' WRK-COD.                               00113500
           DISPLAY 'PRODUTO....' WRK-PROD.                              00113600
           DISPLAY 'VENDAS ....' WRK-QTVEN.                             00113700
                                                                        00113800
      *    FORMATACAO DO VALOR UNITARIO                                 00113900
           MOVE WRK-VALUNI TO WRK-VALUNI-EDT.                           00114000
           DISPLAY 'VALOR  ....' WRK-VALUNI-EDT.                        00115000
                                                                        00115100
      *    CALCULO/ FORMATACAO E DISPLAY DO LUCRO                       00115200
           COMPUTE WRK-LUCRO = WRK-QTVEN * WRK-VALUNI.                  00115300
           MOVE WRK-LUCRO TO WRK-LUCRO-EDT.                             00115400
           DISPLAY 'LUCRO  .R$:' WRK-LUCRO-EDT.                         00115500
                                                                        00115600
      *    CALCULO/ FORMATACAO E DISPLAY DA MEDIA POR DIA               00115700
           COMPUTE WRK-MEDIA = WRK-LUCRO / 5.                           00115800
           MOVE    WRK-MEDIA TO WRK-MEDIA-EDT.                          00115900
           DISPLAY 'MEDIA DE VENDAS R$:'  WRK-MEDIA-EDT ' POR DIA.'.    00116000
                                                                        00116100
      *====================================================             00116200
       2000-99-FIM.                                 EXIT.               00116300
      *====================================================             00116400
                                                                        00116500
                                                                        00119000
      *====================================================             00119100
       3000-FIM                                   SECTION.              00119200
      *====================================================             00119300
                                                                        00119400
           STOP RUN.                                                    00120000
                                                                        00130000
      *====================================================             00131000
       3000-99-FIM.                                  EXIT.              00132000
      *====================================================             00133000
                                                                        00140000
