      *===============================================================*
       IDENTIFICATION                                        DIVISION.
      *===============================================================*
       PROGRAM-ID. FR21LVSA.
      *===============================================================*
      *   AUTOR....:VICTOR ARANDA                                     *
      *   ANALISTA.:IVAN PETRUCCI                  - INSTRUTOR        *
      *   DATA ....:27/06/2022                                        *
      *---------------------------------------------------------------*
      *   OBJETIVO:LEITURA DE UM ARQUIVO (VSAM)                       *
      *                                                               *
      *                                                               *
      *                                                               *
      *---------------------------------------------------------------*
      *   ARQUIVOS:                                                   *
      *   DDNAME......                                                *
      *    DDNAME              I/O                 INCLUDE/BOOK       *
      *---------------------------------------------------------------*
      *   MODULOS....:                             INCLUDE/BOOK       *
      *===============================================================*

      *===============================================================*
       ENVIRONMENT                                            DIVISION.
      *===============================================================*
       CONFIGURATION                                           SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT                                            SECTION.
        FILE-CONTROL.
             SELECT ARQVSAM  ASSIGN TO ARQVSAM
                ORGANIZATION  IS INDEXED
                ACCESS MODE   IS DYNAMIC
                RECORD KEY    IS ARQ-CHAVE
                FILE STATUS   IS FS-ARQVSAM.
      *===============================================================*
       DATA                                                   DIVISION.
      *===============================================================*
       FILE SECTION.
        FD ARQVSAM.
        01 REG-ARQVSAM.
           02 ARQ-CHAVE   PIC X(5).
           02 ARQ-NOME    PIC X(30).
           02 ARQ-SETOR   PIC X(04).
           02 ARQ-SALARIO PIC X(10).
           02 ARQ-DATAADM PIC X(10).
           02 ARQ-EMAIL   PIC X(40).

      *===============================================================*
       WORKING-STORAGE                                        SECTION.
      *===============================================================*

       77 FS-ARQVSAM     PIC 9(2).


      *===============================================================*
       PROCEDURE                                             DIVISION.
      *===============================================================*

      *----------------------------------------------------------------
       0000-PRINCIPAL                                         SECTION.
      *----------------------------------------------------------------

            PERFORM 1000-INICIALIZAR.
             PERFORM 2000-PROCESSAR.
              PERFORM 3000-FINALIZAR.

      *----------------------------------------------------------------
       0000-99-FIM.                                              EXIT.
      *----------------------------------------------------------------

      *----------------------------------------------------------------
       1000-INICIALIZAR                                       SECTION.
      *----------------------------------------------------------------

           OPEN I-O   ARQVSAM.
           IF FS-ARQVSAM NOT EQUAL ZEROS
              DISPLAY 'ERRO NA ABERTURA DO ARQUIVO ARQVSAM'
              DISPLAY 'CODIGO VSAM ' FS-ARQVSAM
              PERFORM 3000-FINALIZAR
           END-IF.

      *----------------------------------------------------------------
       1000-99-FIM.                                              EXIT.
      *----------------------------------------------------------------

      *----------------------------------------------------------------
       2000-PROCESSAR                                         SECTION.
      *----------------------------------------------------------------

           ACCEPT ARQ-CHAVE FROM SYSIN.

           READ ARQVSAM.
           IF FS-ARQVSAM NOT EQUAL ZEROS
              DISPLAY 'REGISTRO NAO ENCONTRADO  '
           END-IF.

      *----------------------------------------------------------------
       2000-99-FIM.                                              EXIT.
      *----------------------------------------------------------------

      *----------------------------------------------------------------
       3000-FINALIZAR                                         SECTION.
      *----------------------------------------------------------------

           CLOSE ARQVSAM.
           DISPLAY REG-ARQVSAM
           DISPLAY ' FINAL DE PROCESSAMENTO '.
           GOBACK.

      *----------------------------------------------------------------
       3000-99-FIM.                                              EXIT.
      *----------------------------------------------------------------
