//FOUR021X JOB 'COMP VSAM',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID
// JCLLIB  ORDER=GR.GERAL.PROCLIB
//COBCOMP  EXEC DFHCOBLB,LIB1=GR.FOUR021,NOME='MD022104',LIB2=GR.GERAL
//SYSTERM  DD  SYSOUT=*
//LKED.SYSIN    DD   *
  NAME  MD022104(R) *
/*
