//FOUR021X JOB 'COMP CO',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID,TIME=(0,01)  00010003
//EXECUTAR EXEC PGM=MD022101                                            00140009
//STEPLIB  DD   DSN=GR.GERAL.LOADLIB,DISP=SHR                           00220001
//EVSA0407 DD   DSN=GR.IVAN.EVSA0407,DISP=SHR                           00230010
//SYSOUT   DD   SYSOUT=*                                                00250007
//SVSA0407 DD   SYSOUT=*                                                00250109
//SV0407EX DD   SYSOUT=*                                                00250211
